[
    {
        "name": "The Algorithm",
        "nick": "algorithm",
        "year": "2024",
        "description": "<i><a href='https://whatsthealgorithm.com/index.html'>The Algorithm</a></i> was built by <a href='https://aliaelkattan.com/'>Alia ElKattan</a> and <a href='https://lujainibrahim.com/'>Lujain Ibrahim</a>, of <a href='https://decifer.tech/'>Decifer Studio</a>, through the generous support of <a href='https://foundation.mozilla.org/en/what-we-fund/awards/creative-media-awards/'>The Mozilla Foundation's Creative Media Award</a>.<br><br><i>The Algorithm</i> aims to demystify recommender systems for the broader public. It is a part of a larger mission to leverage creative coding and web-based experiences to build public literacy of emerging technologies.<br><br>I created a series of modular animations in P5JS to act as the content for this experience.<br><br>You can play it for free <a href='https://whatsthealgorithm.com/index.html'>here</a>.",       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "pics": [
            "animations_1.gif",
            "animations_2.gif",
            "loading.gif"
        ]
    },
    {
        "name": "Slam City Oracles Arcade",
        "nick": "sco",
        "year": "2024",
        "description": "Slam City Oracles is a rambunctious, riot grrrl, Katamari-meets-Grand Theft Auto physics game, in which you and a friend slam onto the world around you to cause as much chaos as possible in two minutes. It was designed and programmed by <a href='https://janefriedhoff.com/'>Jane Friedhoff</a> with art by <a href='https://x.com/q_dork'>Jenny Jiao Hsia</a> and music by <a href='https://scullyscully.bandcamp.com/album/encounters'>Scully</a>.<br><br>In 2024 I was hired to update the arcade version of the game to add features, modernize it and make the game easier to expand. This update debuted at the Nitehawk Cinema Prospect Park, where the arcade machine was featured in the lounge.",       
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "cSLT0M.gif",
            "Slam-City.jpg",
            "dIxPVh.gif",
            "E5TO0.png"
        ]
    },
    {
        "name": "Skirmish Society",
        "nick": "skirmish",
        "year": "2023",
        "description": "Played online and in Discord, Skirmish Society is a game of diplomacy and espionage that turns your DMs into marching orders. Invite our gamemaster bot to your server and they’ll generate a dynamic world for you and your friends to conquer -- cooperatively or otherwise.<br><br>Skirmish Society is a wargame inspired by Diplomacy that uses Discord as an interface. I built it over the coure of about 4 years with help from members of the Death By Audio Arcade community.<br><br>It is available <a href='https://skirmishsociety.com/'>here</a>.<br><br>Design & Programming by Andy Wallace<br>Backend Programming by <a href='http://dustmop.io/'>Dustin Long</a><br>Frontend Programming by <a href='https://walt.codes/'>Walt Mitchell</a> and <a href='http://robysoft.net/'>Nick Santaniello</a><br>Icons by <a href='https://twitter.com/iscariot83'>Chris Hernandez</a><br>Trailer by <a href='https://trashpandaqc.xyz/'>Trash Panda QC</a>",       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "vid": "<iframe width='672' height='378' src='https://www.youtube.com/embed/PpN41oLDsl4' frameborder='0' allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "pics": [
            "vid",
            "file-11.jpg",
            "Screenshot_20210608-165524.png",
            "file-14.jpg",
            "screenshot.jpg"
        ]
    },
    {
        "name": "Shitty Space Camp",
        "nick": "shitty_space_camp",
        "year": "2023",
        "description": "The Night Market is <a href='https://withfriends.co/event/16166236/lost_horizon_night_market'>“a transient bazaar where one can encounter a variety of mysterious lounges, theaters, galleries, cafes, installations and other establishments, all situated within seemingly ordinary box trucks.”</a><br><br>My partner, <a href='https://janefriedhoff.com/'>Jane Friedhoff</a>, and I have been talking about running an event called Shitty Space Camp for years and Night Market seemed like the perfect opportunity. Every kid wants to go to space camp, but some kids wind up at SSC, a low-budget disappointment run by people who'd rather be anywhere else. Come experience the wonders of space expressed as a bunch of stuff we found in the trash. No refunds. And what better place for our fly-by-night operation than the back of a U-Haul truck?<br><br>Thanks to our teammates <a href='https://www.instagram.com/usumoio/'>Mike</a>, <a href='https://www.instagram.com/modern_girl_blitz/?hl=en'>Midge</a>, <a href='https://twitter.com/Iscariot83'>Chris</a> & <a href='https://www.instagram.com/bacon_and_legs/'>Dane</a>.<br><br>A writeup with more pictures can be found on <a href='https://andymakesgames.tumblr.com/post/717409616832708608/shitty-space-camp-explored-the-cosmos-at-night'>my blog</a>.<br><br>Photos by <a href='https://www.jochiang.com/'>Jo Chiang</a>.",       
        "tags": [
            "All",
            "Other"
        ],
        "pics": [
            "ssc1.jpg",
            "ssc2.jpg",
            "ssc3.jpg",
            "ssc4.jpg",
            "ssc5.jpg"
        ]
    },
    {
        "name": "Star Catcher",
        "nick": "star_catcher",
        "year": "2022",
        "description": "Walking into a lush untainted forest floor, immersed in the sounds of nature and engulfed by a canopy of falling stars, audience members are handed shimmering nets and invited to catch stars as they move through this nature scene. The world is alive on its own, yet responds to the audience's actions within its ecosystem. This immersive game is an invitation to get lost together, but also to be observant.<br><br>Star Catcher is an ongoing project in development by <a href='https://twitter.com/adellelin?lang=en'>Adelle Lin</a> and <a href='https://www.instagram.com/mpinner/'>Matt Pinner</a>, that uses whimsy to contemplate our relationship with consumption and its environmental impact.<br><br>I was hired to create procedural plants and animations that are used to decorate the space and show the overall health of the system. The drawings used for these plants were created by <a href='https://www.salchen.com/'>Sal Chen</a>.<br><br>Description by <a href='https://touchtech.io/StarCatcher-Plasma-Our-Shared-Planet'>touchtech.io</a><br>Video by Adelle Lin<br>Photos by <a href='http://jeremygrier.co/'>Jeremy Grier</a>",       
        "tags": [
            "All",
            "Featured",
            "Game"
        ],
        "vid": "<iframe width='672' height='378' src='https://www.youtube.com/embed/1MDecZbq8kE' frameborder='0' allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "pics": [
            "vid",
            "_DSF0934.JPG",
            "_DSF0937.JPG",
            "_DSF0952.JPG"
        ]
    },
    {
        "name": "Cold Sun Surf",
        "nick": "cold_sun",
        "year": "2022",
        "description": "Created for the <a href='https://itch.io/jam/pico-1k-2022'>PICO-1K</a> jam, the entire source code for this tight & twitchy arcade game is less than 1024 bytes. The game's page includes a full breakdown of the code.<br><br>You can play it <a href='https://andymakes.itch.io/cold-sun-surf'>here</a>.",       
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "space_7.gif"
        ]
    },
    
    {
        "name": "Pico Pond",
        "nick": "pico_pond",
        "year": "2022",
        "description": "This is a Pico-8 demake of the fantastic <a href='https://frogchorus.com/?pond=the_big_pond'>Frog Chorus</a> by <a href='https://v21.io/'>v buckenham</a> & <a href='https://www.vivianeschwarz.co.uk/'>Viviane Schwarz</a>. It is a networked experience which makes it fairly unusual for Pico-8!<br><br>I have a detailed description of how the networking works along with the game's source code <a href='https://github.com/andymasteroffish/pico_pond_front'>here</a>.<br><br>You can play it <a href='https://andymakes.itch.io/pico-pond'>here</a>. You'll need a friend, or you might get lucky and meet a stranger!",       
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "game_small.jpg"
        ]
    },
    {
        "name": "Fuzzy Borders",
        "nick": "fuzzy_borders",
        "year": "2022",
        "description": "Fuzzy borders is a life-sized game of expansion and negotiation. Players claim their space with giant carpet tiles and attempt to maneuver their way into creating the highest scoring shapes and patterns on the ground. While playing, they are free to talk to and negotiate with their fellow players–however, they are physically limited to only standing on the space they have claimed with their carpet tiles<br><br>Fuzzy borders was created as part of the <a href='http://www.thecelltheatre.org/player-indigo'>Player Indigo Game Maker Residency</a> and was first shown at <a href='http://www.thecelltheatre.org/'>The Cell Theater in Manhattan</a> in February of 2022<br><br>You can read about the creation of this game <a href='https://andymakesgames.tumblr.com/post/681606618637565952/fuzzy-borders-design-journal'>here</a>.<br><br>Photos by <a href='https://www.instagram.com/osmworks/'>Osmany Cabrera</a>.",       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "pics": [
            "PlayerIndigo-94-show.jpg",
            "PlayerIndigo-15-card.jpg",
            "PlayerIndigo-96-gameplay.jpg",
            "PlayerIndigo-04.jpg",
            "poster_small.jpg"
        ]
    },
    {
        "name": "FLDC - The Beauty of Unity",
        "nick": "fldc",
        "year": "2021",
        "description": "This 40-foot, multi-user, double sided projection mapped interactive experience hallway gives users a way to share their museum experience at the FLDC museum in Philadelphia, displaying items they interacted with in the museum in a playful environemnt. Users interact with the space via motion-tracked wands.<br><br>I was contracted by <a href='https://www.rc.tech/'>Remote Control Technology</a> to develop the software that drives the experience in Unity 3D.",       
        "tags": [
            "Featured",
            "All",
            "Freelance"
        ],
        "vid": "<iframe width='672' height='378' src='https://www.youtube.com/embed/PpN41oLDsl4' frameborder='0' allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "pics": [
            "unity.jpg"
        ]
    },
    {
        "name": "Night Voyagers",
        "nick": "night_voyagers",
        "year": "2021",
        "description": "Night Voyagers is a code poem created for <a href='https://taper.badquar.to/7/index.html'>Taper #7: Wonders</a>.<br><br>It uses ASCII art and generative prose to create a procedural animation in under 2K bytes (the size requirement for all entries in Taper)<br><br>It is best <a href='https://taper.badquar.to/7/night_voyagers.html'>viewed live on the Taper site</a>.",       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "pics": [
            "voyagers5.jpg",
            "voyagers4.jpg",
            "voyagers3.jpg",
            "voyagers2.jpg",
            "voyagers1.jpg"
        ]
    },
    {
        "name": "ofxGCode",
        "nick": "ofxgcode",
        "year": "2021",
        "description": "ofxGCode is an open-source C++ library for <a href='https://openframeworks.cc/'>openFrameworks</a> that makes it easy to create g-code files for pen-plotting or laser printing.<br><br>I built it up over two years of creating plotter art with my AxiDraw plotter. Although ofxGCode was created with my plotter in mind, the output can be used in any machine that utilizes 2D movement.<br><br>You can view the library <a href='https://github.com/andymasteroffish/ofxGCode'>here</a>.",       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "pics": [
            "anim.gif"
        ]
    },
    {
        "name": "Pac-Tracer",
        "nick": "pac_tracer",
        "year": "2021",
        "description": "This piece was commissioned by the <a href='https://arts.mit.edu/cast/'>MIT Center for Art, Science & Technology (CAST)</a> for the <a href='https://generative-unfoldings.mit.edu/'>Generative Unfoldings</a> exhibiton. Pac-Tracer is a programatic animation that examines the elegance and liveliness of the original Pac-Man AI, developed in 1980, by following the paths of Pac-Man and the four ghosts through an extruded 3D maze. Pac-Man’s AI represents some of the earliest and still most compelling work in games AI, with simple rules evoking the sense that each ghost has its own personality and own predispositions for mischief.<br><br>The rules that define the ghost movement are not truly adversarial: rather, they are about spatial desires. Each ghost has a place they want to be relative to Pac-Man and their fellow ghosts. This project allows those desires to play out unfettered by concerns about gamestate, or for that matter, any human interloper. By tracing those paths through the maze, the idiosyncrasies and personalities emerging from those rules become clear. What was a hunt now looks more like a waltz of attraction.<br><br>To compliment the web-app, I created a series of <a href='http://andymakes.com/?p=plotter_prints/pac_path'>plotter drawings</a> from frames of the animation.<br><br>You can view Pac-Tracer on the <a href='https://generative-unfoldings.mit.edu/works/pac-tracer/view.html'>Generative Unfoldings website.</a><br><br>This project was also featured in the Inter/Access exhibition <a href='https://sculptedandforged.com/pac-tracer'>Sculpted in Our Image, Forged in Our Minds</a>.",       
        "tags": [
            "Featured",
            "Toy",
            "All"
        ],
        "pics": [
            "1.jpg",
            "pac_00_full.JPG",
            "2.jpg",
            "3.jpg",
            "4.jpg"
        ]
    },
    {
        "name": "Non-Non Fungible Token Collection",
        "nick": "non-nft",
        "year": "2021",
        "description": "This somewhat tongue-in-cheek collection was a reaction to the wave of NFT and crypto-currency support in the digital art world in 2021. This collection of 20 unique animated gifs are for sale on Itch.io for $30 each. What ownership means in this case is up to the person purchasing the image.<br><br>You can see the store page <a href='https://andymakes.itch.io/non-non-fungible-token-collection-archipelagos'>here</a>.",       
        "tags": [
            "Featured",
            "Other",
            "All"
        ],
        "pics": [
            "twitter.jpg",
            "archipelago_01.gif"
        ]
    },
    {
        "name": "Twisty Tunnels",
        "nick": "twisty_tunnels",
        "year": "2021",
        "description": "This quick-reflex pixel-art game was created as a demo game for the <a href='https://indiemakersyndicate.com/'>Indie Maker Syndicate</a> <a href='https://itch.io/jam/imsjjr'>Jam Jam Revolution</a>, which I helped to run. It was originally designed to be played using the custom hardware that all participants built for the jam, but I later released it as a keyboard-controlled game.<br><br>You can play this game for free in-browser <a href='https://andymakes.itch.io/twisty-tunnels-keyboard'>here</a>.<br><br>Although it takes strong visual influence from the <a href='https://www.lexaloffle.com/pico-8.php'>Pico-8 Fantasy Console</a>, it was built using <a href='https://p5js.org/'>P5.js</a>. This was an opportunity to use many of the visual techniques I had developed writing tweet-length visual programs in the <a href='https://twitter.com/search?q=%40andy_makes%20%23tweetcart&src=typed_query'>#tweetcart</a> and <a href='https://twitter.com/search?q=%40andy_makes%20%23p5t&src=typed_query'>#p5t</a> hashtags.<br><br>The audio was created by <a href='http://jayackley.com/'>Jay Ackley</a>.",       
        "tags": [
            "Game",
            "All"
        ],
        "pics": [
            "title.png",
            "spin.png",
            "level_complete2.png",
            "2021-03-04.gif",
            "gem_get.png"
        ]
    },
    {
        "name": "Pen Plotter Art",
        "nick": "plotter",
        "year": "2020",
        "description": "I create and sell pen-plotter drawings made using an <a href='https://shop.evilmadscientist.com/productsmenu/846'>AxiDraw V3 plotter</a>.<br><br>A complete list of my plotter art can be found in the <a href='/#Plotter'>Plotter</a> heading of this portfolio.<br><br>The code to generate these drawings is written by me, and in most cases allows for variations such that no two drawings will be the same. All of the drawings are written in C++ using <a href='http://openframeworks.cc/'>openFrameworks</a> and my own open-source <a href='https://github.com/andymasteroffish/ofxGCode'>G-Code library</a>.<br><br>These drawings are done using archival quality ink on ph-neutral paper.<br><br>Available drawings can be purchased from <a href='https://andymakes.bigcartel.com/'>my store</a>.",       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "max_height" : 600,
        "pics": [
            "day_22_trim_small.jpg",
            "day_27_trim_small.jpg",
            "day_09_small.jpg",
            "day_19_full_small.jpg",
            "day_18_trim_small.jpg",
            "day_24_trim_small.jpg"
        ]
    },
    {
        "name": "MTG Plotter Prints",
        "nick": "plotter_cards",
        "year": "2020",
        "description": "While quarantining, I used my <a href='https://axidraw.com/'>AxiDraw Pen Plotter</a> to print a proxy <i>Magic The Gathering</i> deck to play with friends over webcam.<br><br>To translate the complex art in the game into instructions my plotter could read, I created a suite of tools in <a href='http://openframeworks.cc/'>openFrameworks</a> that allowed me to break the image up into layers and apply different filters (also designed by me). The layout and borders were programmed from scratch, but drew inspiration from the source cards.<br><br>The library I made to convert openFrameworks drawings into gcode is freely available <a href='https://github.com/andymasteroffish/axidraw_gcode_reader'>here</a>.<br><br>The cards were primarily printed using Uni-ball metallic inks.<br><br>The <a href='https://andymakesgames.tumblr.com/tagged/magic-the-gathering'>complete collection</a> can be seen on my Tumblr.",       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "vid":"<iframe src='https://player.vimeo.com/video/405855697' width='640' height='400' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe><p><a href='https://vimeo.com/405855697'>Force of Will Plotter print Time-lapse</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "IMG_7738_color.JPG",
            "IMG_7808_small.jpg",
            "IMG_7940_trim.jpg",
            "IMG_7914_trim_small.jpg",
            "2020-03-12_mystic_tutor.png"
        ]
    },
    {
        "name": "Turf Wars",
        "nick": "touchdown",
        "year": "2020",
        "description": "My partner <a href='https://janefriedhoff.com/'>Jane Friedhoff</a> and I were hired by <a href='https://www.teamwass.com/'>Wasserman Media Group</a> to license, “reskin,” and install our game <a href='/?p=salmon'>Salmon Roll: The Upstream Team</a> at the AT&T booth at the College Football Playoff Fan Central expo in New Orleans. This involved changing the visuals and some gameplay to have a football theme, and designing and creating new custom controllers for the game.<br><br><a href='https://twitter.com/Iscariot83'>Chris Hernandez</a> created the new sprites & <a href='https://rottentuna.games/'>Kyle Magocs</a> fabricated the controllers.",       
        "tags": [
            "Featured",
            "All",
            "Game",
            "Freelance"
        ],
        "pics": [
            "IMG_4834.JPEG",
            "touchdown_gameplay_small.png",
            "IMG_7225.JPG",
            "IMG_7242.JPG"
        ]
    },
    {
        "name": "Killipede Music Video",
        "nick": "killipede",
        "year": "2019",
        "description": "I directed and animated this music video for the song Killipede by <a href='http://danfriel.com'>Dan Friel</a> off his new album <a href='https://thrilljockey.com/products/fanfare'>Fanfare</a>. The video was written entirely in C++ using openFrameworks and makes heavy use of JPEG corruption.<br><br>I wrote a lengthy post about the creation of this video on <a href='https://andymakesgames.tumblr.com/post/187892688614/killipede-programming-a-music-video'>my blog</a>.<br><br>I also created the <a href='/?p=fanfare'>album cover</a> for Fanfare using methods developped for the video.",       
        "tags": [
            "Featured",
            "All",
            "Other",
            "Freelance"
        ],
        "vid": "<iframe width='560' height='315' src='https://www.youtube.com/embed/TqJs0wnVZq4' frameborder='0' allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "pics": [
            "vid",
            "arrow_1714.png",
            "protozoa_1109.png",
            "protozoa_4719.png",
            "triangle_4127.png"
        ]
    },
    {
        "name": "Fanfare Album Cover",
        "nick": "fanfare",
        "year": "2019",
        "description": "After creating the music video for <a href='/?p=killipede'>Killipede</a> for <a href='http://danfriel.com'>Dan Friel</a> I used the same techniques to generate this image, which was used as the cover of his album <a href='https://thrilljockey.com/products/fanfare'>Fanfare</a>.",       
        "tags": [
            "All",
            "Other",
            "Freelance"
        ],
        "pics": [
            "fanfare_smaller.png"
        ]
    },
    {
        "name": "Machiavelli & Cheese Truck",
        "nick": "maciavelli",
        "year": "2019",
        "description": "The Night Market is <a href='https://withfriends.co/event/595315/lost_horizon_night_market'>“a transient bazaar where one can encounter a variety of mysterious lounges, theaters, galleries, cafes, installations and other establishments, all situated within seemingly ordinary box trucks.”</a><br><br>In 2019 I helped create the Machiavelli & Cheese Truck, a brutal food truck that preyed on the worst impulses of man. The design was lead by <a href='https://www.larissahayden.com/'>Larissa Hayden</a>.<br><br>In addition to creating the truck, I acted as the carnival barker, luring participants in and selecting a suitable \"prince\" in each group. That's me in the first pictrue. I wrote about the creation of the truck <a href='https://andymakesgames.tumblr.com/post/185529281439/lost-horizon-night-market-2019-machiavelli'>here</a>.<br><br>The first image was taken by <a href='https://gothamist.com/arts-entertainment/photos/photos-inside-the-box-trucks-that-briefly-transformed-this-queens-street-into-an-immersive-art-experience?image=5'>Tod Seelie for Gothamist.</a>",       
        "tags": [
            "All",
            "Other"
        ],
        "pics": [
            "main.jpg",
            "tumblr_inline_psyj1cfdCf1txnfdi_1280.jpg",
            "tumblr_inline_psyj1i3d0h1txnfdi_1280.jpg"
        ]
    },
    {
        "name": "Vector Mace",
        "nick": "vector_mace",
        "year": "2019",
        "description": "This port of my game <a href='/?p=particlemace'>PARTICLE MACE</a> is displayed on a hacked Vectrex display, allowing it to be played on the whiter-than-white vector screen that inspired the look of the game.<br><br>It is a controlled via a hacked IBM joystick from the same era and topped off with a <a href='https://www.etsy.com/listing/564082324/vectrex-overlay-reproductions-and'>psychadelic gel overlay</a>.<br><br>This project was made possible by <a href='https://trmm.net/'>Trammell Hudson</a> who donated the Vectrex unit and worked on the <a href='https://github.com/osresearch/vst?tab=readme-ov-file'>V.st board</a> that drives the display.",
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "IMG_4713.JPG",
            "IMG_4722.JPG",
            "2019-05-03.jpg"
        ]
    },
    {
        "name": "Ziggurat of the Titan Beetle",
        "nick": "ziggurat",
        "year": "2019",
        "description": "Ziggurat of the Titan Beetle is a four-player party rougelike where players must communicate and work together to beat dungeons. Despite striving towards a common goal, time pressure and shared resources make it easy to accidentaly step on each other's toes.<br><br>This game was created as an exclusive reward for backers of the <a href='https://www.kickstarter.com/projects/markkleeb/wonderville-arcade'>Wonderville Kickstarter campaign</a>.<br><br>Sprites and logo by <a href='https://twitter.com/Iscariot83'>Chris Hernandez</a>.<br><br>The <a href='https://en.wikipedia.org/wiki/Titan_beetle'>Titan Beetle</a> is a real creature and the largest known species of beetle.",       
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "pics": [
            "gameplay.jpg",
            "store.jpg",
            "damage.jpg",
            "title.jpg"
        ]
    },
    {
        "name": "Circumnavigators",
        "nick": "circum",
        "year": "2018",
        "description": "Created in collaboration with <a href='http://junomorrow.com'>Juno Morrow</a>, Circumnavigators is a physical arcade game where players must run around a circular strip of LEDs attempting to keep their glowing dot safe. Tapping the arcade buttons along the top moves the obstacles (represented by different color bars). Players must physically keep up with their dot and are encouraged to sabotage other players.<br><br>The game was initially created at <a href='https://deathbyaudioarcade.com'>Death By Audio Arcade’s</a> Alt.Ctrl Jam where it was built into a garbage can. Andy and Juno have since built a proper housing for it and it has been shown at Caveat, Secret Project Robot, MAGFest 2019 & the <a href='https://americanart.si.edu/events/saam-arcade'>Smithsonian American Art Museum Arcade</a> in 2019.<br><br>First photo by <a href='http://www.robysoft.net/'>Nick Santaniello</a>.<br><br>Video by Juno Morrow.",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "vid": "<div style='padding:56.25% 0 0 0;position:relative;'><iframe src='https://player.vimeo.com/video/371966195' style='position:absolute;top:0;left:0;width:100%;height:100%;'' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/371966195'>Circumnavigators</a> from <a href='https://vimeo.com/junom'>Juno Morrow</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "mag19-31_small.jpg",
            "IMG_5283_small.jpg",
            "gif_small_256_color.gif"
        ]
    },
    {
        "name": "Arcade Truck",
        "nick": "night_market",
        "year": "2018",
        "description": "The Night Market is <a href='https://withfriends.co/event/595315/lost_horizon_night_market'>“a transient bazaar where one can encounter a variety of mysterious lounges, theaters, galleries, cafes, installations and other establishments, all situated within seemingly ordinary box trucks.”</a> Years after I helped with my <a href='http://andymakes.com/?p=cuddle'>first truck</a>, I returned with <a href='https://www.deathbyaudioarcade.com/'>Death By Audio Arcade</a> to build an arcade installation in a truck.<br><br>The truck featured three arcade games, hanging light art, and a piece of video art projected across the entire truck to create a sensory-overload imagined alternate future arcade.<br><br>You can read more about the installation <a href='http://andymakesgames.tumblr.com/post/179396583389/dbaa-at-the-lost-horizons-night-market'>on my blog.<br><br><a href='https://twitter.com/Iscariot83'>Chris Hernandez</a>, <a href='http://www.allen-riley.com/'>Allen Riley</a> & <a href='https://twitter.com/dustmop'>Dustin Long</a> of DBAA also helped design and execute the truck.<br><br>Photos by <a href='http://uglymachine.net/'>Emi Spicer</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "pics": [
            "1.jpg",
            "2.JPG",
            "3.JPG",
            "4.JPG"
        ]
    },
    {
        "name": "Chalice of Brevium",
        "nick": "chalice",
        "year": "2018",
        "description": "<a href='http://andymakes.com/chalice/'>Chalice of Brevium</a> is an experimental roguelike created while following along with a game-a-week class being taught by my my colleague at LIU, <a href='https://twitter.com/ramirocorbetta'>Ramiro Corbetta</a>. Players must work together to push the Chalice to the portal.<br><br>The board state is shared by all players and it is interacted with one user at a time.  Although they can practice as long as they’d like, each user gets only a single, 10-second chance to advance the game. After this they are locked out until the current board is beaten. Furthermore, players must use one of three classes, all of which are required to advance and protect the chalice, forcing them to work together (or fail).<br><br>It can be played for free at <a href='http://andymakes.com/chalice'>andymakes.com/chalice</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "pics": [
            "death.gif",
            "1.png",
            "2.png"
        ]
    },
    {
        "name": "Pivop",
        "nick": "pivop",
        "year": "2018",
        "max_height" : 600,
        "description": "Pivop is a small, one-button arcade game about a swinging head. It was created in one week while following along with a game-a-week class being taught by my colleague at LIU, <a href='https://twitter.com/ramirocorbetta'>Ramiro Corbetta</a>.<br><br>Pivop is free and can be played in the browser on <a href='https://andymakes.itch.io/pivop'>Itch.io</a>.<br><br>This game is also available on the <a href='https://wondervillenyc.square.site/?shipping=true&item=383'>Death By Audio Arcade Snack Pack Vol 3</a>.<br><br>The art in the game was created using <a href='https://fernandoramallo.itch.io/doodle-studio-95'>Doodle Studio 95</a> and the music was composed by me on a <a href='https://www.teenageengineering.com/products/po-32'>Pocket Operator Tonic</a>.",
       
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "gameplay.gif",
            "title.gif",
            "still_shot.png",
            "title_itch.gif"
        ]
    },
    {
        "name": "A Place To Bury Strangers Pinball",
        "nick": "pinball",
        "year": "2018",
        "description": "<a href='https://www.deathbyaudioarcade.com/a-place-to-bury-strangers-pinball/'>A Place To Bury Strangers Pinball</a> is a custom pinball machine created by Death By Audio Arcade and themed around the NYC psychedelic rock band <a href='https://aplacetoburystrangers.bandcamp.com/'>A Place To Bury Strangers</a>.<br><br>The machine itself is a repurposed 1959 Gottlieb Mademoiselle that was gutted and rebuilt using modern technology, including a fog machine, strobe lights, lasers, and LED lighting.<br><br>Credits:<br>Hardware and Electronics: <a href='http://kleebtronics.com/'>Mark Kleeb</a> & <a href='http://crudlabs.org/'>Steve Litt</a><br>Software and Programming: Andy Wallace & <a href='http://dustmop.io/'>Dustin Long</a><br>Playfield Artwork: <a href='https://www.behance.net/joejurewicz'>Joe Jurewicz</a><br>Marquee Artwork: <a href='https://vimeo.com/prestonspurlock'>Preston Spurlock</a><br>Sound Design: <a href='https://grooms.bandcamp.com/'>Travis Johnson</a><br>Graphic Design: <a href='https://twitter.com/Iscariot83'>Chris Hernandez</a><br>Original Music and Video: A Place To Bury Strangers<br><br>A more detailed writeup can by found on the <a href='https://www.deathbyaudioarcade.com/a-place-to-bury-strangers-pinball-blog'>Death By Audio Arcade blog</a><br><br>First photo by <a href='https://withfriends.co/team'>Joe Ahearn</a>",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "vid": "<iframe width='700' height='450' src='https://www.youtube.com/embed/u5J5mHw6u3s'></iframe>",
        "pics": [
            "vid",
            "Joe_Ahearn_MVIMG_20180715_151226.jpg",
            "board.jpg",
            "IMG_1722.JPG"
        ]
    },
    {
        "name": "The DreamBoxXx",
        "nick": "dreamboxxx",
        "year": "2018",
        "description": "I worked with <a href='http://www.deathbyaudioarcade.com/'>Death By Audio Arcade</a> to create <a href='https://www.deathbyaudioarcade.com/dreamboxxx/'>The DreamboxXx</a>, a queer arcade machine that now lives at <a href='https://www.facebook.com/TheSpectrumBK/'>Dream House/Spectrum</a>, a queer events space in Brooklyn. This arcade machine contains 9 games by local queer and trans developers created specifically for this hardware. I managed this project, working with <a href='https://brid.gs/'>Ayla Myers</a> to curate and invite the participating devs. I also wrote the software that ran in the arcade machine to allow users to select their game and to make sure it would remain stable in a public space.<br><br>The games were later released by the devs as <a href='https://itch.io/b/239/the-dreamboxxx-bundle-custom-made-lgbtq-arcade-games'>a bundle</a> to raise money for the Sylvia Sylvia Rivera Law Project and Make The Road New York.<br><br>Photos by <a href='http://gothamist.com/2018/05/31/dbaa_dreamhouse_arcade_games.php#photo-1'>Walter Wlodarczyk</a>.<br><br>A post about designing and building the launcher can be found on <a href='http://andymakesgames.tumblr.com/post/174438083814/creating-the-dreamboxxx-a-queer-winnitron'>my blog</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "pics": [
            "0.jpg",
            "1.jpg",
            "2.jpg",
            "3.jpg",
            "4.jpg"
        ]
    },
    {
        "name": "Lost Wage Rampage",
        "nick": "lost_wage",
        "year": "2018",
        "description": "Lost Wage Rampage by Jane Friedhoff is a fast, raucous, arcade driving game about what happens when two shopgirls find out their male coworkers have been paid more than them, and decide to steal back the difference. Lost Wage Rampage was made possible by a commission from the Peabody Essex Museum.<br><br><a href='http://janefriedhoff.com/'>Jane Friedhoff</a> did level design, game design, and general coding, <a href='http://marlowe.dobbe.com/'>Marlowe Dobbe</a> did art and animation, and I created the procedual level generation framework.<br><br>The game can be played for free on the <a href='http://playtime.pem.org/lost-wage-rampage-a-game/'>PEM website</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "pics": [
            "title.gif",
            "1.jpg",
            "2.png"
        ]
    },
    {
        "name": "Nike NY vs NY Kiosk",
        "nick": "nike",
        "year": "2018",
        "description": "I developed the interface for an LED news-ticker that was mounted along the four walls of a kiosk for Nike’s NY VS NY exhibition basketball games over the summer of 2018.<br><br>My openFrameworks app pulled information about the games from a database and converted it into a format that could be used by the LED display. Nike later contracted me again to update the project for the 2018 World Series.",
       
        "tags": [
            "Featured",
            "All",
            "Freelance"
        ],
        "pics": [
            "nike.png"
        ]
    },
    {
        "name": "Triple Tone Curious Creature",
        "nick": "tone",
        "year": "2018",
        "description": "A mysterious lifeform is contacting us from deep in space.<br>It sings to us and desperately wants us to answer with the same song.<br><br>This game was created for Global Game Jam 2018 at LIU Post using a custom capacitive touch controller built on site. The game was written in openFrameworks and the controller uses an Arduino and an <a href='https://learn.adafruit.com/adafruit-mpr121-12-key-capacitive-touch-sensor-breakout-tutorial/overview'>MPR121 capacitive touch sensor</a> (and some tin foil).<br><br>Players attempt to combine wave forms to match the tone generated by the alien.<br><br>The game is available (in a keyboard controlled form) for <a href='https://andymakes.itch.io/triple-tone-curious-creature'>free on Itch</a>.",
       
        "tags": [
            "All",
            "Game"
        ],
        "vid": "<div class='vid_holder'><iframe src='https://player.vimeo.com/video/253294316' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div>",
        "pics": [
            "vid",
            "1.png",
            "2.JPG",
            "3.png",
            "4.JPG"
        ]
    },
    {
        "name": "Urza's Dream Engine",
        "nick": "urza",
        "year": "2017",
        "description": "Urza's Dream Engine is a neural network art bot that generates original images in the style of card art from the <i>Magic: The Gathering</i> collectible card game. It was inspired by <a href='https://twitter.com/RoboRosewater'>@RoboRosewater</a>, another neural network that generates card text for the game. After gathering and cropping all existing art from the game (roughly 30,000 cards over the two decades that <i>Magic</i> has been in print), I broke the art down into sections based on the type of card it came from and allowed the bot to train for a week before asking it to generate images in the same style. These images were eventually used in combination with the RoboRosewater text to hold a tournament with entirely machine-generated cards.<br><br>The images created by the bot, as well as several downloads, including print-and-play cards are available under a Creative Commons license at the bottom of the <a href='http://andymakes.com/urzasdreamengine/'>project's page</a>.<br><br>Urza's Dream Engine was created using <a href='https://github.com/carpedm20/DCGAN-tensorflow'>this Tensorflow implementation</a> of Deep Convolutional Generative Adversarial Networks by <a href='https://carpedm20.github.io/'>Taehoon Kim</a>.<br><br>Photo by <a href='http://lippemfg.org/'>Lippe</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Other"
        ],
        "pics": [
            "collection2.png",
            "output2.png",
            "R_171118-magic-0055.jpg"
        ]
    },
    {
        "name": "Bleep Space",
        "nick": "bleep",
        "year": "2017",
        "description": "Bleep Space was inspired by playing with a friend’s Korg sequencer and the joy I found in creating music while exploring a device that I didn’t fully understand. Created in collaboration with local musician <a href='http://danfriel.com/'>Dan Friel</a>, Bleep Space is a sequencer toy for iOS, PC & Mac. Users tap the screen to add noisy samples to their sequence and watch as lively geometric animations accompany the sounds.<br><br>Bleep Space was a finalist at the 2017 <a href='http://www.indiecade.com/index.php/2017/games'>IndieCade Festival</a> and was shown at the <a href='https://americanart.si.edu/events/saam-arcade'>Smithsonian American Art Museum Arcade</a> in 2019.<br><br>In addition to the free digital release, I worked with <a href='http://www.kleebtronics.com/'>Mark Kleback</a> to create a tabletop installation to house the game, featuring light-up tactile buttons and a round screen. This device is currently touring different locations in New York and was debuted at the IndieCade festival in L.A..<br><br>More info at <a href='http://bleepspace.com/'>BleepSpace.com</a>.<br>Development info <a href='http://andymakesgames.tumblr.com/tagged/bleep-space'>here</a>.",
       
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "vid": "<div class='vid_holder'><iframe src='https://player.vimeo.com/video/236515448' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-17%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/236515448'>Bleep Space Trailer</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "indiecade.jpg",
            "norm.png",
            "step.png",
            "cab.jpg"
        ]
    },

    {
        "name": "Salmon Roll: The Upstream Team",
        "nick": "salmon",
        "year": "2017",
        "description": "In the summer of 2017, Jane Friedhoff and I were commissioned to make an installation game for <a href='http://play-nyc.com/'>Play NYC</a>, a games conference in NYC held in Terminal 5. We created Salmon Roll: The Upstream Team, a two player collaborative game with a five foot long custom controller based on the 1983 arcade game Ice Cold Beer (also the inspiration for TumbleSeed).<br><br>We also served as co-chairs of Installation Games for the conference and curated a collection of other installation games made for the event by local digital artists and game designers.<br><br>Salmon Roll was also shown at the <a href='https://americanart.si.edu/events/saam-arcade'>Smithsonian American Art Museum Arcade</a> in 2019.<br><br>Game by Andy Wallace and <a href='http://janefriedhoff.com/'>Jane Friedhoff</a>.<br>Art by <a href='http://radstronomical.com/'>Diego Garcia</a><br>Photos by <a href='http://www.jochiang.com/'>Jo Chiang</a><br><br>Brief write-up of our development process <a href='http://andymakesgames.tumblr.com/post/164215709449/salmon-roll-the-upstream-team-design-notebook'>here</a>.",
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "pics": [
            "IMG-9415.jpg",
            "IMG-9822.jpg",
            "logo_trim.png",
            "IMG-9969.jpg",
            "IMG-9513.jpg",
            "IMG-9845.jpg"
        ]
    },
    {
        "name": "Noise Snke",
        "nick": "noisesnke",
        "year": "2016",
        "description": "Noise Snke is an experimental Snake game that plays with data mutability by writing its board state directly to the sound card. The harsh sound that it creates highlights the fact that to a computer, data has no intrinsic meaning and can be used for any purpose.<br><br>Noise Snke was shown in Korea in 2016 at the <a href='http://bicfest.org/'>Busan Indie Connect Festival</a>. Game and a write-up is available <a href='https://andymakes.itch.io/noise-snke'>here</a>.",
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "max_height" : 500,
        "vid": "<div class='vid_holder'><iframe src='https://player.vimeo.com/video/170259186' style='position:absolute;top:0;left:0;width:100%;height:100%; margin-left:-33%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/170259186'>Noise Snke (turn down your volume)</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "pic1.png",
            "pic2.png",
            "chart.png"
        ]
    },
    {
        "name": "TCG Proxy Gen",
        "nick": "tcgproxy",
        "year": "2016",
        "description": "<a href='https://andymakes.itch.io/tcg-proxy-generator'>TCG Proxy Gen</a> & <a href='https://andymakes.itch.io/booster-pack-generator'>TCG Booster Gen</a> are a set of tools which allow players and designers to print cards for trading card games such as Magic The Gathering. TCG Proxy Generator is a more user friendly, GUI based application that allows users to drag and drop card images to create ready-to-print proxy sheets. TCG Booster Gen is a more powerful tool which can be used to create full booster packs, either to test fan sets or to run proxy booster drafts. I made these tools to help facilitate <a href='http://www.kotaku.com/fan-organized-magic-the-gathering-tournament-only-allo-1791821047'>Weird MTG</a>, a series of tournaments and games I organize aimed at exploring unusual or overlooked aspects of Magic: The Gathering.<br><br>Both tools were made in openFrameworks and are available for free on <a href='https://andymakes.itch.io'>itch.io</a>.",
        "tags": [
            "All",
            "Other"
        ],
        "max_height" : 600,
        "pics": [
            "booster-gen_itch.png",
            "shot0.PNG",
            "shot4.png"
        ]
    },
    {
        "name": "Hungry Hungry Astronauts",
        "nick": "hungryhungry",
        "year": "2016",
        "description": "<a href='http://www.deathbyaudioarcade.com/'>Death By Audio Arcade</a> was commissioned by the meal replacement company Soylent to develop an arcade machine that featured their astronaut mascot. I designed an implemented an original 4-player Pac-Man-style game for the project.<br><br>The arcade cabinet was fabricated by <a href='http://www.kleebtronics.com/'>Mark Kleback</a> and <a href='https://twitter.com/Iscariot83'>Chris Hernandez</a> created the art for the game and the arcade cabinet.<br><br>The arcade was playable for a few weeks in Solylent’s pop-up in L.A. and now occasionally pops up in unexpected places.",
        "tags": [
            "All",
            "Game",
            "Freelance"
        ],
        "pics": [
            "1.jpg",
            "2016-09-01_crown_shift.gif",
            "2.jpg",
            "3.jpg"
        ]
    },
    {
        "name": "Drink Rink",
        "nick": "drinkrink",
        "year": "2016",
        "description": "Drink Rink is a bar and a game platform created with fellow <a href='http://deathbyaudioarcade.com/'>Death By Audio Arcade</a> members <a href='http://www.kleebtronics.com/'>Mark Kleback</a> and <a href='http://whomakesgames.me/'>K. Anthony Marefat</a>. Drinks are placed in special coozies that are seen by the cameras in the bar and used as game pieces for the game projected up onto surface. The bar runs a collection ambient games and cycles between them. In 2018, several additional scenes that would react to hands or anything placed on the bar were added. The bar debuted at the <a href='http://lwlvl.com/'>Lwlvl</a> chiptune festival in Brooklyn.<br><br>Some photos by <a href='http://gothamist.com/2018/05/31/dbaa_dreamhouse_arcade_games.php#photo-1'>Walter Wlodarczyk</a>.",
        "tags": [
            "Featured",
            "All",
            "Game",
            "Toy"
        ],
        "pics": [
            "w1.jpg",
            "1.jpg",
            "w2.jpg",
            "2.GIF",
            "w3.gif",
            "4.gif"
        ]
    },
    {
        "name": "Genetic Combat",
        "nick": "genetic",
        "year": "2016",
        "description": "This browser simulation attempts to create effective spaceship shooter AI using a genetic algorithm. The game itself is roughly based on <a href='https://www.youtube.com/watch?v=3m86ftny1uY'>Combat for the Atari 2600</a>. When it starts, all ships are created with a completely randomized set of rules that govern their behavior. Once all of the ships in a given generation get a chance to compete, the ones that got the most kills (with a bonus for not dying themselves) are allowed to continue to the next generation and to have children. The children inherit the same set of behaviors that the parents had, but mutate them slightly: a value gets changed here and there, maybe a rule gets removed or a new one gets added. Even though these changes are random, over many generations the natural selection process selects for mutations that make them more effective pilots.<br><br><a href='http://www.andymakesgames.com/extras/combatgenetics/'>Full site here</a><br>Also avalaible on <a href='https://andymakes.itch.io/combat-genetics'>itch.io</a>",
        "tags": [
            "All",
            "Toy"
        ],
        "pics": [
            "pic1.png",
            "pic2.png",
            "pic3_wide.png"
        ]
    },
    {
        "name": "Steam Users Don't Know What They Want",
        "nick": "steamusers",
        "year": "2016",
        "description": "This Chrome extension attempts make sense of Steam reviews by changing the text of any “do not recommend” review by a user who has played over 24 hours of the game to “I do not know what I want.”<br><br><a href='https://chrome.google.com/webstore/detail/steam-users-dont-know-wha/abgbfcdlibmeecalpedlcddjcgjecihn?hl=en'>Available for free on the Chrom Web Store.</a>",
        "tags": [
            "All",
            "Other"
        ],
        "pics": [
            "pic1.png",
            "pic2.png",
            "pic3.png"
        ]
    },
    {
        "name": "ZipCalc!",
        "nick": "zipcalc",
        "year": "2016",
        "description": "It’s the geolocative calculator of nobody's dreams! ZipCalc is a Hell Products and a joke about consumerism bought to its breaking point. It's a calculator that uses your phone's GPS to find your zip code and adds it to the result.<br><br>The app was also an elaborate ploy to sneak in an easter egg asking my amazing partner Jane to marry me (she said yes!).<br><br>You can download it for free on the <a href='https://itunes.apple.com/us/app/zipcalc/id1130420532?mt=8&ign-mpt=uo%3D4'>iOS app store</a>.",
        "tags": [
            "All",
            "Other"
        ],
        "max_height" : 600,
        "pics": [
            "0.jpeg",
            "1.jpeg",
            "2.jpeg"
        ]
    },
    {
        "name": "Terminal Town",
        "nick": "terminaltown",
        "year": "2016",
        "description": "Terminal Town is a small, experimental puzzle that exists as a series of mysterious & anthropomorphized command line tools. Every executable is a person or a tool and every folder is a place.<br><br>Players are tasked with opening the chest (a command line tool) in the center of town, and must learn how use the files that inhabit the town. There is no way to cheat. Everything in the game is just a file on the computer and can be treated as such.<br><br>While some experience with the terminal is helpful, the game does not require anything intense, and acts as a fun way to learn about a powerful part of the computer that many users are unfamiliar with.<br><br>It is <a href='https://andymakes.itch.io/terminal-town'>available for free</a> (Mac only).",
        "tags": [
            "All",
            "Featured",
            "Game"
        ],
        "pics": [
            "itch_icon.gif",
            "1.png",
            "2.png",
            "3.png"
        ]
    },
    {
        "name": "Satan.Dance",
        "nick": "satandance",
        "year": "2016",
        "description": "<a href='http://www.satan.dance'>Satan.Dance</a> is a cut-up web toy that stitches one word clips from the 90s police propaganda film <a href='https://www.youtube.com/watch?v=Rt_T5EF-uzU'>Law Enforcement Guide To Satanic Cults</a>.<br><br>It was written in <a href='https://p5js.org/'>P5.js</a> as part of a class I took at <a href='http://sfpc.io/'>The School For Poetic Computation</a>.<br><br>It can be viewed at <a href='http://www.satan.dance'>satan.dance</a>.",
        "tags": [
            "All",
            "Toy"
        ],
        "max_height" : 600,
        "pics": [
            "satan2.gif"
        ]
    },
    {
        "name": "Intimate Codex",
        "nick": "intimatecodex",
        "year": "2016",
        "description": "<a href='https://andymakes.itch.io/intimate-codex'>Intimate Codex</a> is an interactive non-linear text explorer that allows the user to traverse static text from a more first-person perspective. Books, poems, and any other texts fed into it are broken up into passages, and the user can move between these passages by typing a particular word on screen. After submitting that word, they are brought to a new passage that shares that word.<br><br>By providing connections between different passages (and even entirely different works) based on keywords and randomness, new narratives and meanings appear that can be vastly different from the original, linear stories.<br><br>Users are also encouraged to provide their own text, either from stories they like or their own original writing.<br><br>It can be downloaded for pay-what-you-want <a href='https://andymakes.itch.io/intimate-codex'>here</a><br><br>The overall experience was inspired by <a href='http://www.herstorygame.com/'>Her Story</a>.",
        "tags": [
            "Featured",
            "All",
            "Game"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/149687218' style='position:absolute;top:0;left:0;width:100%;height:100%; margin-left:-11%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/149687218'>Intimate Codex</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "pic0.png",
            "pic1.png"
        ]
    },
    {
        "name": "The Easter Money",
        "nick": "eastermoney",
        "year": "2016",
        "description": "The Easter Money is a low stakes gambling game designed by me & <a href='http://janefriedhoff.com/'>Jane Friedhoff</a> for my family's 2016 Easter party. Your goal is to end the game with the most money cards (or at least as much as you started with).<br><br>The game is <a href='https://andymakes.itch.io/the-easter-money'>available for free as a print print-and-play</a> in both color and b/w variants.<br><br>The illustrations on the color cards come from the New York Public Library's <a href='https://www.nypl.org/research/collections/digital-collections/public-domain'>collection of public domain images</a>.",
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ]
    },
    {
        "name": "Bloom Cave",
        "nick": "bloom",
        "year": "2016",
        "description": "Bloom Cave is an endless cave-gardening sim created in 48 hours for Global Game Jam 2016 for the theme ”ritual”. Moving past the edge of a room will cause a new one to be created based on the runes in the crurrent garden. The runes are inscrutable, though, forcing the player to simply wander and enjoy.<br><br>It can be played for free <a href='https://andymakes.itch.io/bloom-cave'>here</a>.<br><br>Music by <a href='http://bubblepipemedia.com/'>Nathaniel Chambers.</a>",
        "tags": [
            "All",
            "Game"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/153699269' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-10%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/153699269'>Bloom Cave, Global Game Jam 2016</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "rune_cycle.gif",
            "1.png",
            "2.png",
            "title.png"
        ]
    },
    {
        "name": "PARTICLE MACE",
        "nick": "particlemace",
        "year": "2015",
        "description": "PARTICLE MACE is a game for Windows, Mac and iOS that pays homage to classic space shooters, but replaces the typical guns with an unruly physics-based weapon. Players control a tiny ship in an extremely hostile universe, and must defend themselves as long as possible from enemy ships and asteroids using a collection of trash particles tethered to the ship. To survive, players must carefully navigate around the many hazards while building up momentum to swing their weapon into foes or other players.<br><br>Inspired by twitchy arcade classics old and new, PARTICLE MACE requires quick reflexes to stay alive, rewarding skilled players with high scores worth bragging about and giving new players a reason to hit restart. Graphically, the game uses abstracted visuals to create a striking play field combined with an entrancing procedural background.<br><br>More info at <a href='http://particlemace.com'>particlemace.com</a>.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/102190423' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/102190423'>PARTICLE MACE Trailer</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "arcade0.png",
            "multiplay1.png",
            "arcade1.png",
            "multiplay2.png"
        ]
    },
    {
        "name": "Extreme Exorcism",
        "nick": "exorcism",
        "year": "2015",
        "description": "Extreme Exorcism is best described as a mixture of Braid and Super Crate Box. With each ghost you kill, another takes its place. You’ve been given access to a multitude of devastating weapons to rid the spirits--the only problem is, they copy your every attack.<br><br>Extreme Exorcism was born out of a small window of time we had between projects at Golden Ruby Games and became our first multi-console release.<br><br>The game is available on <a href='http://store.steampowered.com/app/334100/'>Steam for PC and Mac</a> as well as PS3, PS4, Xbox One and Wii U",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/107056301' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/107056301'>Extreme Exorcism Trailer</a> from <a href='https://vimeo.com/user11855679'>Golden Ruby Games</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "pic0.jpg",
            "pic1.jpg",
            "pic2.jpg",
            "pic3.jpg"
        ]
    },
    {
        "name": "Musclebound Glory",
        "nick": "musclebound",
        "year": "2014",
        "description": "Musclebound Glory is a card- and prop-based party game about channeling your inner 80s action hero and crafting the perfect kill line. Players hear a randomized action movie-style moment (including the villain being killed, the method of annihilation, and a twist), for which they must craft the perfect killer zinger. Players don berets, bandoliers, and Ray Bans to deliver their lines in style. The best line is decided by the group, and a new hero walks away from the explosion victorious, never turning back.<br><br>Musclebound Glory was shown at <a href='http://www.comeoutandplay.org/project/musclebound-glory/'>Come Out And Play 2014</a> in New York. We provided the deck and a carefully curated collection of props<br><br>Photo by <a href='https://www.flickr.com/photos/liabulaong/14707849584/in/set-72157645412278598'>Lia Bulaong</a>",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "pics": [
            "proxy.jpg",
            "MuscleboundGlory_GameLogoFORMATTED.jpg",
            "MuscleboundGlory_GamePhoto1FORMATTED.jpg",
            "MuscleboundGlory_GamePhoto3FORMATTED.jpg",
            "muscleguy.png"
        ]
    },
    {
        "name": "Hermit Crab In Space",
        "nick": "hermitcrab",
        "year": "2013",
        "description": "Originally created as part of the Sony-sponsored PlayStation Mobile jam at the first Indiecade East, Hermit Crab In Space is the third game by Golden Ruby Games. One part Star Fox, one part Minecraft, with a healthy dose of Captain Forever mixed in, Hermit Crab in Space won the IndieCade East GameJam in February 2013 and became a <a href='http://www.indiecade.com/2013/nominees/'>finalist at IndieCade</a> the following year.<br><br>Players take the role of a hermit crab who has warped herself into the wrong sector and must cobble together a ship from the parts she blasts off her opponents. The game makes use of the touch screen and tactile buttons of the Sony Vita by allowing players to drag free-floating pieces to their ship and then select a button to activate them. This means that players create their ship and control scheme on the fly while playing.<br><br>Level and enemy design by <a href='http://janefriedhoff.com/'>Jane Friedhoff</a>.<br><br>It is available on any PSM enabled device, but is intended to be played on the Vita. You can visit its PSM page <a href='http://us.playstation.com/games/hermit-crab-in-space-psm.html'>here</a>.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/70116079' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/70116079'>Hermit Crab in Space - Official Trailer</a> from <a href='https://vimeo.com/user11855679'>Golden Ruby Games</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "hermitCrab1.jpg",
            "hermitCrab2.jpg",
            "hermitCrab3.jpg",
            "hermitCrab4.jpg",
            "hermitCrab5.jpg"
        ]
    },
    {
        "name": "Worm Run",
        "nick": "wormrun",
        "year": "2013",
        "description": "You are Zeke Tallahassee, hapless space miner in the wrong place at the wrong time. Swipe on your touchscreen to move Zeke through an ever-changing labyrinth all while being chased by a blood-thirsty, gigantic space Worm.<br><br>This was our second title at Golden Ruby Games and was made available for iOS, Android, & Windows 8.<br><br>Our goal with this game was to create a control scheme for platformers that made sense for touch screens. We did this by adopting a gestural control scheme, rather than using clunky on-screen buttons, creating a tense, platforming experience actually designed for the device the game was being played on.<br><br>We also explored potential for a shared multiplayer experience that used iPhones as controllers when we ran a special four-person version of the game at the <a href='http://gowanusloft.com/'>Gowanus Loft</a> in Brooklyn.<br><br>A detailed description of how the procedural caves of Worm Run are created can be found <a href='http://www.gamasutra.com/blogs/AndyWallace/20140108/208248/Procedural_Level_Generation_In_Worm_Run.php'>here</a>.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/82397975' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/82397975'>Worm Run Updated Trailer</a> from <a href='https://vimeo.com/user11855679'>Golden Ruby Games</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "wormRun0.png",
            "wormRun5.JPG",
            "wormRun1.png",
            "wormRun2.png",
            "wormRun3.png",
            "wormRun4.png"
        ]
    },
    {
        "name": "Doodle Defense",
        "nick": "doodledefense",
        "year": "2012",
        "description": "Doodle Defense is a tower defense game that explores drawing as a means for game interaction and play. Players draw mazes and towers on a whiteboard with regular dry erase markers to stop projected foes. The game received 150% backing on Kickstarter and has been featured on <a href='http://indiegames.com/2012/02/kinect_and_ipad_kickstarter_do.html'>IndieGames.com</a>, <a href='http://www.engadget.com/2012/02/16/doodle-defense-game-uses-kinect-to-turn-white-boards-into-displa/'>Engadget</a>, <a href='http://www.pcworld.com/article/250250/indie_kinect_game_turns_your_doodles_into_weapons_of_war.html'>PC World</a>, <a href='http://www.ubergizmo.com/2012/02/doodle-defense/'>Ubergizmo</a>, <a href='http://www.fastcodesign.com/1669089/doodle-defense-turns-a-whiteboard-into-a-battlefield'>FastCo Design</a>, and many other publications. It went on to be shown at <a href='http://comeoutandplaysf.org/2012/doodle-defense/'>Come Out And Play San Francisco</a>, <a href='https://www.sfmoma.org/'>SF MOMA</a> and the <a href='https://dublin.sciencegallery.com/''>Dublin Science Gallery</a>.<br><br>The game uses a camera and a projector in conjunction with the whiteboard to create a unique platform for play. The code and system is all my own, written in openFrameworks. The code is open source and can be viewed <a href='https://github.com/andymasteroffish/DoodleDefense'>here</a>.<br><br>All art in the game was done by <a href='http://moderngirlblitz.tumblr.com/'>Michelle Belickis</a>.<br><br>The game is available for free for whiteboard at <a href='http://www.doodledefense.com'>doodledefense.com</a> and for <a href='https://itunes.apple.com/us/app/doodle-defense-mobile/id562738461?ls=1&amp;mt=8'>$2 on iPad</a>.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/56350840' style='position:absolute;top:0;left:0;width:100%;height:100%; margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/56350840'>DoodleDefenseTrailer</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "doodleDefense1.png",
            "doodleDefense2.jpg",
            "doodleDefense3.jpg",
            "doodleDefense4.jpeg",
            "doodleDefense5.png",
            "doodleDefense6.png",
            "doodleDefense7.jpeg"
        ]
    },
    {
        "name": "Find Me A Good One",
        "nick": "findme",
        "year": "2012",
        "description": "Find Me A Good One was created with <a href='http://llcl.lc/'>Haitham Ennasr</a> as our MFA thesis at Parsons The New School For Design, and was nominated as an <a href='http://www.indiecade.com/2012/games/'>IndieCade 2012 Finalist</a>. It is available for free for PC or Mac <a href='http://andymakes.itch.io/find-me-a-good-one'>here.</a><br><br>Find Me A Good One is a puzzle platformer that explores the sense of responsibility felt by players towards non-playing fictional characters. Although the brother in Find Me A Good One is clearly dependent on the player, it is up to the player to decide how much they want to help their sibling. While most games force the player to complete the task at hand in order to move on, Find Me A Good One allows the player to be diligent in their responsibility, or shirk it in order to further explore the dreamscape of the game. Because the system does not assign value to her actions, the player is left to judge their own actions and the effect they have on their virtual brother.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "max_height" : 400,
        "pics": [
            "thesisSitePic0.png",
            "thesisSitePic1.png",
            "thesisSitePic2.png",
            "thesisSitePic3.png",
            "thesisSitePic4.jpg"
        ]
    },
    {
        "name": "Destroy All Color",
        "nick": "destroycolor",
        "year": "2012",
        "description": "The first game we released at Golden Ruby Games, Destroy All Color! is a fast-paced puzzle game played by using the iPhone's camera to find and use colors in the player's environment to destroy blocks on screen. The color choosen is then used in the subsequent levels, getting progressively more difficult. This makes for a unique and interesting game mechanic that combines the real world around the player with the digital puzzle of the game.",
        "tags": [
            "All",
            "Game"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/47744504' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/47744504'>Destroy All Color! Trailer</a> from <a href='https://vimeo.com/user11855679'>Golden Ruby Games</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "dac1.PNG",
            "dac2.PNG",
            "dac3.PNG"
        ]
    },
    {
        "name": "Chase No Face",
        "nick": "chase",
        "year": "2012",
        "description": "To shoot this video we programmed a series of masks in openFrameworks based on the face tracking code developed by <a href='http://thesystemis.com/'>Zach Lieberman</a> and <a href='http://www.daito.ws/'>Daito Manabe</a> using the FaceTracker library by <a href='http://jsaragih.org/'>Jason Saragih</a>. No post-production effects were used: everything in the video was recorded live, using a hacked Kinect, a laptop, a projector and a DSLR camera. Some of the masks respond to movement and others respond to sound, creating an expressive outcome.<br><br><a href='http://bellinspace.com/'>Bell</a> is a Brooklyn-based independent musician.<br><br>Project team : <a href='http://thesystemis.com/'>Zach Lieberman</a> (General direction, programming, video direction), <a href='http://franciscozamorano.cl/'>Francisco Zamorano</a> (Video direction, editing, programming), Andy Wallace (programming), <a href='http://cargocollective.com/michellecalabro'>Michelle Calabro</a> (camera).<br><br>Photos and blurb by Francisco Zamorano",
        "tags": [
            "All",
            "Other",
            "Featured",
            "Freelance"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/26689220' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/26689220'>Chase No Face / BELL</a> from <a href='https://vimeo.com/fzamorano'>Francisco Zamorano</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "noFace6.jpg",
            "noFace0.jpg",
            "noFace1.jpg",
            "noFace3.jpg",
            "noFace4.png",
            "noFace5.jpg"
        ]
    },
    {
        "name": "Horse_ebooks Talker",
        "nick": "horseebooks",
        "year": "2012",
        "description": "The Horse_ebooks Talker deals with the id of the internet in the form of Twitter spam-bot extraordinaire, <a href='https://twitter.com/Horse_ebooks'>Horse_ebooks</a>. This Twitter account advertises its products, but avoids the spam filters by grabbing random snippets of text from across the internet to appear ”alive” and in the process creates a compelling Dadaist tapestry of text from across the internet. This project tries to put these words back in the mouths of people by providing an augmented reality for anybody who looks at it, assigning them a random tweet to appear in a word balloon above their head.<br><br>This piece was featured in <a href='http://www.openconceptgallery.org/'>Open Concept Gallery's</a> Smart Multimedia Festival.",
        "tags": [
            "All",
            "Other",
            "Toy"
        ],
        "pics": [
            "horseebooks1.png",
            "horseebooks2.jpg",
            "horseebooks3.png"
        ]
    },
    {
        "name": "All Cyrax Wants To Do Is Dance",
        "nick": "cyrax",
        "year": "2012",
        "description": "This simple HTML5 game was created as an exercise to learn jQuery, which I felt like I really ought to know. It tells the touching story of a cybernetic ninja who just wants to get down.<br><br>It can be played <a href='portfoliofiles/cyrax/'>here</a>.",
        "tags": [
            "All",
            "Game"
        ],
        "max_height" : 550,
        "pics": [
            "cyrax1.png",
            "cyrax2.png",
            "cyrax3.png",
            "cyrax4.png"
        ]
    },
    {
        "name": "Broken Mirror",
        "nick": "brokenmirror",
        "year": "2011",
        "description": "Broken Mirror is a camera application made in <a href='http://openframeworks.cc/'>openFrameworks</a> for the iPhone and iPad that takes the incoming camera feed and breaks it apart into a pixelated and constantly moving mosaic. Users can control the degree of abstraction in the image.<br><br><a href='https://itunes.apple.com/us/app/broken-mirror/id511029924'>The app is 99 cents on the iOS store.</a>",
        "tags": [
            "All",
            "Toy"
        ],
        "max_height" : 600,
        "pics": [
            "brokenMirror1.jpeg",
            "brokenMirror2.jpeg",
            "brokenMirror3.jpeg"
        ]
    },
    {
        "name": "Sound Balls",
        "nick": "soundballs",
        "year": "2011",
        "description": "Created as my first year final project at Parsons, Sound Balls is a non-traditional method of sound generation that blends digital and analog elements in the form of a new audio toy. By manipulating a set of smart balls, users convert real world action into a fluid sound-scape that affords play and exploration. The system as a whole has two unique modes of interaction: Free Form and Singing Bowl, and users learn the rules of these systems while interacting with the balls. The balls themselves have unique attributes in both their hardware and the way the information from them is converted into sound. The information is gathered from each ball by an implanted micro-controller and sent wirelessly to a computer where it is interpreted in order to create the sound.<br><br>Design Document: <a href='portfoliofiles/soundballsmaterials/SoundBallsWallace.pdf'>Here</a><br><br>Base Station Arduino Code: <a href='portfoliofiles/soundballsmaterials/BaseStationFinal.pde'>Here</a><br><br>Ball Transmitter Arduino Code: <a href='portfoliofiles/soundballsmaterials/BallTransmitterFinal.pde'>Here</a><br><br>Transmitter Wiring Diagram: <a href='portfoliofiles/soundballsmaterials/ballWiringDiagram.png'>Here</a><br><br>Receiver openFrameworks Code: <a href='portfoliofiles/soundballsmaterials/soundBallsReciever.zip'>Here</a><br><br>SuperCollider Code: <a href='portfoliofiles/soundballsmaterials/soundBalls.rtf'>Here</a>",
        "tags": [
            "All",
            "Toy",
            "Other"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/23824657' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/23824657'>Sound Balls</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "1.jpg",
            "2.jpg",
            "3.jpg"
        ]
    },
    {
        "name": "ASCII Filter",
        "nick": "ascii",
        "year": "2011",
        "description": "Based on an example project by <a href='http://benfry.com/''>Ben Fry</a> packaged with the Processing language, this program takes incoming video and converts it to a text output. Pixels from the original image are considered as a group, and each letter is chosen based on both its overall weight as well as how well the shape fits the pixel group.<br><br>Ben Fry's original required the use of color to show the image, but to have a filter that felt authentic to ASCII art, I wanted to create one that worked in simple black and white.<br><br>Processing Source Code: <a href='portfoliofiles/ASCIIfilterWallace.zip'>Here</a>",
        "tags": [
            "All",
            "Toy"
        ],
        "max_height" : 480,
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/27380117' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-17%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/27380117'>ASCII Video Filter</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "1.png"
        ]
    },
    {
        "name": "Sisyphus.nes",
        "nick": "sisyphus",
        "year": "2011",
        "description": "This collection of hacked Super Mario ROMs converts the game into retellings of three Greek myths. While Icarus is fairly straightforward, Prometheus and Sisyphus exploit systems within Mario to create games where the player can neither win nor die.<br><br>Prometheus is forced to collect an unavoidable mushroom before being struck by unavoidable bullets until he eventually reaches an inescapable chamber to wait while time runs out.<br><br>Sisyphus hacks a one-off looping level of the original game to create a mountain that the player continuously scales without ever progressing.<br><br>These ROM hacks were created in collaboration with <a href='http://breechapin.com/'>Bree Chapin</a> and <a href='http://www.justinblinder.com/''>Justin Blinder</a> while we were at Parsons.<br><br>The ROMs can be downloaded <a href='portfoliofiles/sisyphus_dot_nes.zip'>here</a>",
        "tags": [
            "All",
            "Other",
            "Game"
        ],
        "max_height" : 472,
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/49642915' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-23%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/49642915'>SuperSisyphusBros</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "prom1.png",
            "prom2.png",
            "sis.png"
        ]
    },
    {
        "name": "The Cuddle Cave",
        "nick": "cuddle",
        "year": "2011",
        "description": "I worked with<a href='http://janefriedhoff.com'> Jane Friedhoff</a> and <a href='http://www.breefield.com/'>Dustin Hoffman</a> to create a truck for the <a href='http://www.nytimes.com/2011/04/24/arts/design/lost-horizon-night-market-brooklyns-theater-of-the-bizarre.html'>Lost Horizons Night Market</a> called the Cuddle Cave. The Cave consisted of over 150 Ikea pillows in the back of a U-Haul dressed up with satin sheets that could only be gotten to via crawling through a small dark tunnel. Those brave enough to enter were treated with calming music and a soft respite from the cold autumn night outside.",
        "tags": [
            "All",
            "Other",
            "Toy"
        ],
        "pics": [
            "1.jpg",
            "2.jpg",
            "3.jpg",
            "4.jpg",
            "5.jpg",
            "6.jpg"
        ]
    },
    {
        "name": "Star Gaze",
        "nick": "stargaze",
        "year": "2011",
        "description": "This unique side-scroller was created by me and <a href='http://llcl.lc/'>Haitham Ennasr</a> as a proof of concept for our thesis at Parsons, exploring how game mechanics can make players feel responsible for NPCs. The player must pick their brother up at a train station late at night. On their way, they are given the chance to gaze up at the heavens to populate the sparse environment with constellations. However, this consumes an unknown amount of time and causes the player to run the risk of being late. There is no definite good or bad ending, but we observed that players tended to attach emotional weight to this relatively mundane situation.<br><br>It can be played online <a href='portfoliofiles/stargaze/index.html'>here</a>.",
        "tags": [
            "All",
            "Game"
        ],
        "pics": [
            "stargaze0.png",
            "stargaze2.png",
            "stargaze3.png",
            "stargaze4.png",
            "stargaze5.png",
            "stargaze9.png"
        ]
    },
    {
        "name": "Bounce Box",
        "nick": "bouncebox",
        "year": "2011",
        "description": "Bounce Box is a simple but compelling game with just one rule: to keep the balls in the box. With each hit, the colors of the game shift, and as more balls get added, the visuals change more rapidly and the game becomes more difficult.<br><br>Bounce Box is <a href='https://itunes.apple.com/us/app/bounce-box/id511751938?mt=8'>free on the iOS store</a>.",
        "tags": [
            "All",
            "Game"
        ],
        "max_height" : 480,
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/41514080' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-17%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/41514080'>Bounce Box Trailer</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "bouncebox2.png",
            "bouncebox3.png"
        ]
    },
    {
        "name": "Fever Karaoke",
        "nick": "fever",
        "year": "2010",
        "description": "While interning with Eyebeam fellow <a href='http://www.davidjimison.info'>David Jimison</a>, I created animations and worked on the code of his project, Fever Karaoke. The piece was presented in a karaoke bar setting, but after participants selected a song, they were presented with mad-lib style word replacements, which would alter the words of the song as they sang.<br><br>These animations were projected behind the players and danced along with them. The animations are modular and code-driven so that they could be swapped and rearranged easily.",
        "tags": [
            "All",
            "Other",
            "Freelance"
        ],
        "pics": [
            "fever1.jpg",
            "fever2.jpg",
            "fever3.jpg",
            "fever4.jpg"
        ]
    },
    {
        "name": "Isabelle, Poppy & Bling",
        "nick": "ipb",
        "year": "2009",
        "description": "As I was finishing up my undergrad degree, I was approached by musician Justin Braun, to create a music video to promote his new album, <i>Relays From Home</i>. After listening to the song a few times, though, I thought the music was better suited for a game.<br><br>The game was made in Flash uses a collage style and is split into three major sections, each of which takes inspiration from and is directly affected by the music.<br><br>This game was a <a href='http://www.indiegames.com/2009/07/browser_game_pick_isabelle_pop.html'>Browser Game Pick at indieClick.com</a> and was featured in Gamasutra's article <a href='http://www.gamasutra.com/view/news/24749/Best_Of_Indie_Games_Falling_Head_Over_Heels_For_Art_Games.php'>Best of Indie Games: Falling Head Over Heels For Art Games.</a><br><br>It can be <a href='https://andymakes.itch.io/isabelle-poppy-and-bling'>played for free</a>.",
        "tags": [
            "All",
            "Game",
            "Featured"
        ],
        "max_height" : 540,
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/210004094' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-21%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/210004094'>Isabelle Poppy &amp; Bling Gameplay (2009)</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "IPB03.png",
            "IPB04.png",
            "IPB05.png",
            "IPB02.png",
            "IPB01.png"
        ]
    },
    {
        "name": "Roving",
        "nick": "roving",
        "year": "2008",
        "description": "This music video was created in Flash for the pirate puppet rock opera, <a href='http://www.thewhizbang.org'>Jollyship The Whiz-Bang!</a>, which has run in various forms in many theaters throughout New York. The video uses photographs of the puppets from the shows along with collage-style animation to show the drunken heroes braving a storm at sea.",
        "tags": [
            "All",
            "Other"
        ],
        "vid":"<div class='vid_holder'><iframe src='https://player.vimeo.com/video/209999964' style='position:absolute;top:0;left:0;width:100%;height:100%;margin-left:-6%;' frameborder='0' allow='autoplay; fullscreen' allowfullscreen></iframe></div><script src='https://player.vimeo.com/api/player.js'></script><p><a href='https://vimeo.com/209999964'>Roving - Jollyship The Whiz-Bang</a> from <a href='https://vimeo.com/andymakes'>Andy Wallace</a> on <a href='https://vimeo.com'>Vimeo</a>.</p>",
        "pics": [
            "vid",
            "1.jpg",
            "2.png"
        ]
    },


    {
        "name": "Checker Flower",
        "nick": "plotter_prints/checker_flower",
        "year": "2023",
        "description": "9\" x 12\"<br>Micron & Sharpie on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "checker_flower.jpg",
            "checker_flower_close.JPG"
        ]
    },
    {
        "name": "Mountain Climber",
        "nick": "plotter_prints/mountain_climber",
        "year": "2023",
        "description": "9\" x 12\"<br>Micron & marker on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "mountain_climber_full.jpg",
            "mountain_climber_detail_1.JPG",
            "mountain_climber_detail_2.JPG"
        ]
    },
    {
        "name": "Purple Wave",
        "nick": "plotter_prints/purple_wave",
        "year": "2023",
        "description": "9\" x 12\"<br>Micron on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "purple_wave_full.jpg",
            "purple_wave_detail_1.JPG",
            "purple_wave_detail_2.JPG"
        ]
    },
    {
        "name": "Vase",
        "nick": "plotter_prints/vase",
        "year": "2023",
        "description": "9\" x 12\"<br>Micron on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "vase_full.jpg",
            "vase_detail1.JPG",
            "vase_detail2.JPG"
        ]
    },
    {
        "name": "Split View",
        "nick": "plotter_prints/split_view",
        "year": "2023",
        "description": "9\" x 12\"<br>Micron on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "split_view_whole.jpg",
            "split_view_detail1.jpg",
            "split_view_detail2.jpg"
        ]
    },

    {
        "name": "Portals",
        "nick": "plotter_prints/portals",
        "year": "2022",
        "description": "9\" x 12\"<br>Micron and metallic ink on Bristol<br>Metallic ink on art paper",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "portal1_full.JPG",
            "portal2_full.JPG",
            "portal1_detail1.JPG",
            "portal2_detail2.JPG"
        ]
    },
    {
        "name": "Trinket Altar",
        "nick": "plotter_prints/trinket_altar",
        "year": "2022",
        "description": "9\" x 12\"<br>Micron on Bristol.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "take_1_full.JPG",
            "take_2_full.jpg",
            "take_1_detail1.JPG",
            "take_2_detail1.JPG",
            "take_1_process2.JPG"
        ]
    },
    {
        "name": "Rings",
        "nick": "plotter_prints/rings",
        "year": "2022",
        "description": "9\" x 12\"<br>Micron on Bristol<br><br>This pair of drawings uses 4 colors of Micron pens, tightly packed into alternating circles. These circles are offset by small, random amounts to create texture for the rings.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "full.jpg",
            "full2.jpg",
            "detail1.JPG",
            "detal2.JPG",
            "detail3.JPG",
            "detail2.JPG"
        ]
    },
    {
        "name": "Diamond Gamp",
        "nick": "plotter_prints/diamond_gamp",
        "year": "2022",
        "description": "9\" x 12\"<br>Micron on Bristol<br><br>The name of this drawing refers to a <a href='https://lunaticfringeyarns.com/what-is-a-color-gamp/'>color gamp</a>, a weaving technique used to compare interwoven colors.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "diamond_gamp_full.jpg",
            "diamond_gamp_detail_1.JPG",
            "diamond_gamp_detail_2.JPG"
        ]
    },
    {
        "name": "Moiré Tiles",
        "nick": "plotter_prints/moire_tiles",
        "year": "2022",
        "description": "9\" x 12\"<br>Micron on Bristol<br><br>The Moiré pattern in this drawing was inspired by a the artifacting of a coworker's jacket on a video call.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "tiles_full.jpg",
            "tiles_close.JPG",
            "tiles_progress1.JPG"
        ]
    },
    {
        "name": "Bézier Cycle",
        "nick": "plotter_prints/bez_cycle",
        "year": "2022",
        "description": "5.5\" x 4\"<br>Micron on Bristol<br><br>These postcards are created using nearly identical rules. Each curve has the same start and end points. The only difference is the relative angles of the control points, which are randomized for each drawing.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "01.JPG",
            "02.JPG",
            "03.JPG",
            "04.JPG",
            "05.JPG",
            "06.JPG",
            "07.JPG",
            "08.JPG"
        ]
    },
    {
        "name": "Greeble Cell",
        "nick": "plotter_prints/greeble_cell",
        "year": "2022",
        "description": "12\" x 9\"<br>Micron on Bristol<br><br>This recursive design exists as a set of large prints and smaller postcards.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "full.jpg",
            "group.JPG",
            "pair.JPG",
            "detail1.JPG"
        ]
    },
    {
        "name": "DBAA Logo",
        "nick": "plotter_prints/dbaa_logo",
        "year": "2021",
        "description": "12\" x 9\"<br>Micron on Bristol<br><br>This drawing of the <a href='https://deathbyaudioarcade.com'>Death By Audio Arcade</a> logo was created for the <a href='https://www.32auctions.com/organizations/75301/auctions/114568?r=1&t=all'>organization's fundraiser auction</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "dbaa_trim.JPG",
            "close.JPG",
            "process3.JPG"
        ]
    },
    {
        "name": "Taffy Pull",
        "nick": "plotter_prints/taffy",
        "year": "2021",
        "description": "12\" x 9\"<br>Micron on Bristol<br>Metallic ink on art paper<br><br>Both of these drawings are based on <a href='https://twitter.com/Andy_Makes/status/1443020876891447297'>a tweet-length Pico-8 sketch</a> I made.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "taffy2_trim.JPG",
            "taffy1_full.JPG",
            "taffy2_detail.JPG",
            "taffy1_detail1.JPG"
        ]
    },
    {
        "name": "Noise Loops",
        "nick": "plotter_prints/noise_loops",
        "year": "2021",
        "description": "Postcard series<br>Metallic ink on gold paper<br>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "1.JPG",
            "2.JPG",
            "3.JPG",
            "4.JPG"
        ]
    },
    {
        "name": "Capsule",
        "nick": "plotter_prints/capsule",
        "year": "2021",
        "description": "8.5\" x 11\"<br>Metallic ink on skytone paper<br>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "trim.jpg",
            "detail1.JPG",
            "detail2.JPG"
        ]
    },
    {
        "name": "Truisms",
        "nick": "plotter_prints/holzer",
        "year": "2021",
        "description": "Postcard series<br>Micron on Bristol<br><br>Each postcard in this series showcases one of Jenny Holzer's <a href='https://www.moma.org/collection/works/63755'>Truisms</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "1.JPG",
            "2.JPG",
            "3.JPG",
            "4.JPG",
            "5.JPG",
            "6.JPG",
            "7.JPG",
            "8.JPG"
        ]
    },
    {
        "name": "Exploded Circle",
        "nick": "plotter_prints/exploded_circle",
        "year": "2021",
        "description": "Postcard series<br>Micron on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "exploded_circle.jpg",
            "IMG_4214.JPG",
            "IMG_4218.JPG"
        ]
    },
    {
        "name": "Eggs",
        "nick": "plotter_prints/eggs",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "full.JPG",
            "detail.JPG"
        ]
    },
    {
        "name": "Hex Horizon",
        "nick": "plotter_prints/hex_horizon",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol<br><br>The drawings in this series use a modified flood fill algorithm which is distorted along the drawing's axes.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "hex_horizon_trim.JPG",
            "hex_horizon_angle.JPG"
        ]
    },
    {
        "name": "Hex Hills",
        "nick": "plotter_prints/hex_hills",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol<br><br>The drawings in this series use a modified flood fill algorithm which is distorted by noise.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "hex_hill_trim.JPG",
            "hex_hill_detail.JPG",
            "hex_hill_angle.JPG"
        ]
    },
    {
        "name": "Labyrinth Hills",
        "nick": "plotter_prints/labyrinth_hills",
        "year": "2021",
        "description": "9\"x12\"<br>Microns on Bristol<br><br>The drawings in this series use a modified flood fill algorithm which is distorted by noise.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "lab_hill_1_trim.JPG",
            "lab_hill_2_trim.JPG",
            "lab_hill_3_trim.JPG",
            "lab_hill_1_detail3.JPG",
            "lab_hill_2_detail2.JPG"
        ]
    },
    {
        "name": "Pillow Fort",
        "nick": "plotter_prints/pillow_fort",
        "year": "2021",
        "description": "9\"x12\"<br>Microns & rollerball on Bristol<br><br>These two drawings use radial noise & Voronoi tessellation to create interlocking radial patterns. The second drawing overlays two separate designs.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "1full.JPG",
            "2full.JPG",
            "1angle.JPG",
            "1detail.JPG",
            "2detail.JPG"
        ]
    },
    {
        "name": "Distant Planets",
        "nick": "plotter_prints/distant_planets",
        "year": "2021",
        "description": "9\"x12\"<br>Microns on Bristol<br>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "planets_full.JPG",
            "planets_detail_1.JPG",
            "planets_detail_2.JPG",
            "planets_detail_3.JPG"
        ]
    },
    {
        "name": "Spiral Maze",
        "nick": "plotter_prints/spiral_maze",
        "year": "2021",
        "description": "9\"x12\"<br>Microns on Bristol<br>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "trim.JPG",
            "detail1.JPG",
            "detail2.JPG",
            "detail3.JPG"
        ]
    },
    {
        "name": "Pennies",
        "nick": "plotter_prints/pennies",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol<br>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "IMG_2524_trim.JPG",
            "IMG_2530_square.JPG",
            "IMG_2538.JPG"
        ]
    },
    {
        "name": "Text Cascade",
        "nick": "plotter_prints/text_cascade",
        "year": "2021",
        "description": "12\"x9\"<br>Micron on Bristol<br><br>This design was made entirely with ASCII characters.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "trim.jpg",
            "detail1.JPG",
            "detail2.JPG"
        ]
    },
    {
        "name": "Hard Candy Variations",
        "nick": "plotter_prints/hard_candy_variations",
        "year": "2021",
        "description": "34\"x22\"<br>Microns on Bristol<br><br>This large quadriptic is made of four 17\"x11\" sheets. I was commissioned commissioned to make this large-scale version of my <a href='?p=plotter_prints/hard_candies'>Hard Candies</a> plot.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "full.JPG",
            "detail1.JPG",
            "detail2.JPG",
            "detail3.JPG"
        ]
    },
    {
        "name": "Loping Lines",
        "nick": "plotter_prints/loping_lines",
        "year": "2021",
        "description": "9\"x12\"<br>Micron pens on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "loping_1_markers.JPG",
            "loping_2_trim.JPG",
            "loping_3_trim.JPG",
            "loping_3_detail.JPG"
        ]
    },
    {
        "name": "Pomegranates",
        "nick": "plotter_prints/pomegranates",
        "year": "2021",
        "description": "9\"x12\"<br>Micron pens on Bristol",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "02-trim.JPG",
            "02-close1.JPG",
            "01-pomegranate_trim.JPG",
            "01-pomegranate_angled.JPG"
        ]
    },
    {
        "name": "Archipelago",
        "nick": "plotter_prints/archipelago",
        "year": "2021",
        "description": "12\"x9\"<br>Micron or gel pens on Bristol paper.<br><br>This plot was the basis of my <a href='?p=non-nft'>Non-Non Fungible Token Collection</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "archipelago2_full.JPG",
            "arch3_trim.JPG",
            "archipelago1_trim.JPG",
            "arch3_detail2.JPG"
        ]
    },
    {
        "name": "Red Bloom",
        "nick": "plotter_prints/red_bloom",
        "year": "2021",
        "description": "9\"x12\"<br>Gel pen & roller ball on Bristol<br><br>I made two versions of this one. The code has very little randomness, but I ran the black pen at a speed that caused it to unpredictably remove parts of the path.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "bloom2_trim.JPG",
            "bloom2_detail2.JPG",
            "bloom3_trim.JPG",
            "bloom3_detail3.JPG"
        ]
    },

    {
        "name": "Island",
        "nick": "plotter_prints/mtg_island",
        "year": "2021",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>A trading card based on one of the basic land types in <i>Magic: The Gathering</i>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "individual.JPG",
            "group.JPG"
        ]
    },
    {
        "name": "Forest",
        "nick": "plotter_prints/mtg_forest",
        "year": "2021",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>A trading card based on one of the basic land types in <i>Magic: The Gathering</i>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "single.JPG",
            "original.JPG",
            "group.JPG"
        ]
    },
    {
        "name": "Radiant Monolith",
        "nick": "plotter_prints/radiant_monolith",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol paper.<br><br>This piece uses two pens with many tight, nearly overlapping lines.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "monolith_full_1.JPG",
            "monolith_2_full.JPG",
            "monolith_detail2.JPG",
            "monolith_2_detail1.JPG"
        ]
    },
    {
        "name": "Plains",
        "nick": "plotter_prints/mtg_plains",
        "year": "2021",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>A trading card based on one of the basic land types in <i>Magic: The Gathering</i>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "plains_single.JPG",
            "plains_group.JPG"
        ]
    },
    {
        "name": "Fast & Bulbous",
        "nick": "plotter_prints/fast_and_bulbous",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol paper.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "fast_and_bulbous_trim.JPG",
            "fast_and_bulbous_detal1.JPG",
            "fast_and_bulbous_detail2.JPG"
        ]
    },
    {
        "name": "Swamp",
        "nick": "plotter_prints/mtg_swamp",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>A trading card based on one of the basic land types in <i>Magic: The Gathering</i>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "swamp.JPG"
        ]
    },
    {
        "name": "Radiant Labyrinth 1",
        "nick": "plotter_prints/radiant_labyrinth1",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol paper.<br><br>These drawings were inspired by the paintings of <a href='http://www.richardanuszkiewicz.com/'>Richard Anuszkiewicz</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "labyrinth_1_trim.jpg",
            "labyrinth_1_detail1.JPG",
            "labyrinth_1_detail2.JPG"
        ]
    },
    {
        "name": "Radiant Labyrinth 2",
        "nick": "plotter_prints/radiant_labyrinth2",
        "year": "2021",
        "description": "9\"x12\"<br>Micron on Bristol paper.<br><bThese drawings were inspired by the paintings of <a href='http://www.richardanuszkiewicz.com/'>Richard Anuszkiewicz</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "labyrinth_2_trim.jpg",
            "labyrinth_2_detail1.JPG",
            "labyrinth_2_detail2.JPG"
        ]
    },
    {
        "name": "Withering Wall",
        "nick": "plotter_prints/withering_wall",
        "year": "2021",
        "description": "12\"x9\"<br>Micron on Bristol paper.<br><bThe last image is a study for this drawing.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "withering_wall_trim.JPG",
            "withering_wall_detail1.JPG",
            "withering_wall_detail2.JPG",
            "withering_wall_study.JPG"
        ]
    },
    {
        "name": "Halo Tower",
        "nick": "plotter_prints/halo_tower",
        "year": "2021",
        "description": "9\"x12\"<br>Metallic ink on Bristol paper.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "halo_tower1_trim.JPG",
            "halo_tower1_detail2.JPG"
        ]
    },
    {
        "name": "Polar Spacetime Coordinates",
        "nick": "plotter_prints/polar_spacetime",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens & Prismacolor art markers on vintage scientific graph paper.<br><br>The last image is the plot prior to using the art markers.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "polar_full1.JPG",
            "polar_detail1.JPG",
            "polar_pass1.JPG"
        ]
    },
    {
        "name": "Cubes",
        "nick": "plotter_prints/cubes",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens & Prismacolor art markers on vintage scientific graph paper.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "cubes_01.JPG",
            "cubes_01_detail1.JPG",
            "cubes_01_progress.JPG"
        ]
    },
    {
        "name": "Wreath",
        "nick": "plotter_prints/wreath",
        "year": "2020",
        "description": "9\"x12\"<br>Two plots, both drawn with Micron pens & Prismacolor art markers on Bristol paper.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "wreath2_trim.JPG",
            "wreath1_full.JPG",
            "wreath2_detail.JPG",
            "wreath1_detail.JPG",
            "wreath1_progress.JPG"
        ]
    },
    {
        "name": "Geometric Bowie",
        "nick": "plotter_prints/bowie",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>This drawing is based on photograph of David Bowie by Tony McGee. It is made up of many, many small lines and took abut 5 hours to plot.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "bowie_trim.JPG",
            "bowie_detail1.JPG",
            "bowie_detail2.JPG"
        ]
    },
    {
        "name": "Mitosis",
        "nick": "plotter_prints/mitosis",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "mitosis2_trim.JPG",
            "mitosis1_trim.JPG",
            "mitosis2_detail.JPG"
        ]
    },
    {
        "name": "Eddies",
        "nick": "plotter_prints/eddies",
        "year": "2020",
        "description": "12\"x9\"<br>Micron pens on Bristol paper.<br><br>For this plot, I made a vector field particle simulation and traced the paths of the particles as they moved through it. Every plot generates a unique vector field.<br><br>Some of the Vector Field code was actually borrowed from my earliest prototype of <a href='?p=particlemace'>PARTICLE MACE</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "eddies_02_trim.JPG",
            "eddies_01_full.jpg",
            "eddies_02_detail.JPG",
            "eddies_02_progress.JPG"
        ]
    },
    {
        "name": "Ophiomancy",
        "nick": "plotter_prints/ophiomancy",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>This design is loosely based on the <i>Magic: The Gathering</i> card <a href='https://gatherer.wizards.com/pages/card/Details.aspx?printed=true&multiverseid=376439'>Ophiomancer</a>. I made two different versions: one with hatching and one without.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "ophio_02_full.jpg",
            "ophio_01_full.jpg",
            "ophio_01_detail2.JPG",
            "ophio_02_detail2.JPG",
            "ophio_02_progress.JPG"
        ]
    },
    {
        "name": "Snake Ball",
        "nick": "plotter_prints/snake_ball",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pens on Bristol paper.<br><br>A test for Ophiomancy that did not worry about overlapping areas.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "snake_ball_trim.JPG",
            "snake_ball_detail1.JPG",
            "snake_ball_progress.JPG"
        ]
    },
    {
        "name": "Mountain",
        "nick": "plotter_prints/mtg_mountain",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>A trading card based on one of the basic land types in <i>Magic: The Gathering</i>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "take2.JPG"
        ]
    },
    {
        "name": "Gemstone Fracture",
        "nick": "plotter_prints/gemstone",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>I plotted two versions of this design. One fractured, one whole.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "gemstone_trim.JPG",
            "fracture_trim.JPG",
            "gamestone_detail1.JPG",
            "fracture_detail2.JPG"
        ]
    },
    {
        "name": "Lava Lamp",
        "nick": "plotter_prints/lava_lamp",
        "year": "2020",
        "description": "12\"x9\"<br>Micron pens on Bristol paper.<br><br>This series of drawing uses two or three colored pens. The shading is created programmatically by aligning bars of color.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "lava_02_trim.jpg",
            "lava_04_trim.JPG",
            "lava_05_detail2.JPG",
            "lava_05_trim.JPG",
            "lava_07_full.JPG",
            "lava_02_progress.JPG"
        ]
    },
    {
        "name": "Lava Lamp Trading Card",
        "nick": "plotter_prints/lava_lamp_card",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>Trading card sized version of my Lava Lamp drawing. The shading is created programmatically by aligning bars of color.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "lava_card_3.JPG",
            "lava_card_group.JPG",
            "lava_cardback.JPG",
            "lava_card_4.JPG"
        ]
    },
    {
        "name": "Nautilus",
        "nick": "plotter_prints/nautilus",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Inpired by the color blending work of <a href='https://twitter.com/paulrickards'>Paul Rickards</a> the code for this drawing programmatically generates and sorts patterns using 4 colored markers.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "naut_full.JPG",
            "naut_detail2.JPG",
            "naut_detail3.JPG",
            "naut_printing1.JPG"
        ]
    },
    {
        "name": "Venn Diagram Postcard",
        "nick": "plotter_prints/venn_diagram",
        "year": "2020",
        "description": "5.5\"x4.\"<br>Micron pens on Bristol paper.<br><br>Postcard series plotted on heavy cardstock.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "venn_diagram.JPG",
            "stack.JPG",
            "sheet.JPG",
            "printing.JPG"
        ]
    },
    {
        "name": "Hashers Postcard",
        "nick": "plotter_prints/hashers",
        "year": "2020",
        "description": "5.5\"x4.25\"<br>Micron pens on Bristol paper.<br><br>Postcard plotted directly onto heavy cardstock.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "hashers_single.JPG",
            "hashers_amazon_cardstock.JPG",
            "hashers_progress.JPG"
        ]
    },
    {
        "name": "Pac-Path",
        "nick": "plotter_prints/pac_path",
        "year": "2020",
        "description": "9\"x12\"<br>Microns & gel pens on Bristol paper.<br><br>I've always loved the simple but deep AI in Pac-man. In this plot I extruded the maze & modified the ghost logic to work in 3D then plotted their paths through the maze. Each version captures the game at a different point. No two are alike.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "pac_00_full.JPG",
            "pac_05_close.JPG",
            "pac_01_trim.JPG",
            "pac_01_process.JPG"
        ]
    },
    {
        "name": "Disco Ball",
        "nick": "plotter_prints/disco_ball",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>Limited edition trading card. Set of 10.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "disco_ball_single.JPG",
            "disco_ball_double.JPG"
        ]
    },
    {
        "name": "Triangles",
        "nick": "plotter_prints/triangles",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Gel pens on Bristol paper.<br><br>Limited edition trading card. Set of 10.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "triangles_single.JPG",
            "triangles_double.JPG"
        ]
    },
    {
        "name": "Square Twist",
        "nick": "plotter_prints/square_twist",
        "year": "2020",
        "description": "2.5\"x3.5\"<br>Micron pens on Bristol paper.<br><br>Limited edition trading card. Set of 10.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "square_twist_single.JPG",
            "square_twist_double.JPG"
        ]
    },
    {
        "name": "Field Lines",
        "nick": "plotter_prints/field_lines",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Loosely based on magnetic field lines. The code to create these drawings ensures significant differences between each one, two of which are shown here.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "field_lines_01_full.JPG",
            "field_lines_02_full.JPG",
            "field_lines_01_close.JPG",
            "field_lines_02_progress.JPG"
        ]
    },
    {
        "name": "Obelisks",
        "nick": "plotter_prints/obelisks",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens & gel pens on Bristol paper.<br><br>Originally created for Day 9 of Inktober 2020, I have revised and done a few different versions of this drawing.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_09.jpg",
            "obelisks_03.JPG",
            "obelisks_03_detail.JPG",
            "obelisks_02_detail.JPG"
        ]
    },
    {
        "name": "Fault Lines",
        "nick": "plotter_prints/fault_lines",
        "year": "2020",
        "description": "12\"x9\"<br>Micron pens on Bristol paper.<br><br>Created for Day 31 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_31_trim.JPG",
            "day_31_close.JPG",
            "day_31_progress.JPG"
        ]
    },
    {
        "name": "Cell",
        "nick": "plotter_prints/cell",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pens on Bristol paper.<br><br>Created for Day 29 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "cell2_trim.JPG",
            "cell3_detail.JPG",
            "day_29_trim_small.jpg",
            "day_29_close.JPG",
            "day_29_progress.JPG"
        ]
    },
    {
        "name": "Thorn Box",
        "nick": "plotter_prints/thorn_box",
        "year": "2020",
        "description": "9\"x12\"<br>Metallic pens on Bristol paper.<br><br>Created for Day 28 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_28_trim.JPG",
            "day_28_close.JPG"
        ]
    },
    {
        "name": "Hard Candies",
        "nick": "plotter_prints/hard_candies",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Created for Day 27 of Inktober 2020 and later refined. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_27_full.JPG",
            "hard_candies_02_full.JPG",
            "day_27_close.JPG",
            "hard_candies_02_detail.JPG"
            
        ]
    },
    {
        "name": "Seaweed Knot",
        "nick": "plotter_prints/seaweed_knot",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Created for Day 26 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_26_full.JPG",
            "day_25_close.JPG"
        ]
    },
    {
        "name": "Gates",
        "nick": "plotter_prints/gates",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Originally created for Day 24 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_24_full.JPG",
            "day_24_close.JPG"
        ]
    },
    {
        "name": "Foggy Moon",
        "nick": "plotter_prints/foggy_moon",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Created for Day 23 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_23_trim.jpg",
            "day_23_close.jpg"
        ]
    },
    {
        "name": "Faberge Egg",
        "nick": "plotter_prints/faberge_egg",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pen & Metallic pens on Bristol paper.<br><br>Created for Day 21 of Inktober 2020. I made two verisons of this drawing: a monochrome black and a two-tone metallic.<br><br>You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_21_black.jpg",
            "day_21_color.jpg",
            "day_21_close.jpg"
        ]
    },
    {
        "name": "Mesas",
        "nick": "plotter_prints/mesas",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Created for Day 20 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_20_full.jpg",
            "day_20_close.jpg"
        ]
    },
    {
        "name": "Ribbons",
        "nick": "plotter_prints/ribbons",
        "year": "2020",
        "description": "9\"x12\"<br>Varied pens on Bristol paper.<br><br>Created for Day 19 of Inktober 2020. I've made several verisons of this drawing using different inks. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_19_full.JPG",
            "ribbons_03.jpg",
            "day_19_close.JPG",
            "day_19_progress.JPG"
        ]
    },
    {
        "name": "Facts & Figures",
        "nick": "plotter_prints/facts_and_figures",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens & gel pens on Bristol paper.<br><br>Originally created for Day 18 of Inktober 2020, I updated this design in November. Every time the code is run, the values of the graphs are randomized. I've drawn it with a variety of inks.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "facts_03_full.JPG",
            "facts_03_close.JPG",
            "day_18_mono_trim.JPG",
            "facts_04.JPG",
            "day_18_progress.JPG"
        ]
    },
    {
        "name": "Maze",
        "nick": "plotter_prints/maze",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens on Bristol paper.<br><br>Created for Day 16 of Inktober 2020 and later updated. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "maze_03_full.JPG",
            "maze_03_detail2.JPG",
            "day_16_full.JPG",
            "day_16_close.JPG"
        ]
    },
    {
        "name": "Cosmic Horror",
        "nick": "plotter_prints/cosmic_horror",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pens & Metallic pens on Bristol paper.<br><br>Created for Day 15 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_15_full.JPG",
            "day_15_close.JPG"
        ]
    },
    {
        "name": "Thin Mountains",
        "nick": "plotter_prints/thin_mountains",
        "year": "2020",
        "description": "18\"x12\"<br>Metallic ink on Bristol paper.<br><br>Created for Day 13 & 4 of Inktober 2020. I created two variations of this drawing. Both are gold ink on large black paper.<br><br>You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_13_trim.jpg",
            "day_14_full.jpg",
            "day_13_close.jpg",
            "day_14_close.jpg"
        ]
    },
    {
        "name": "Fill Circles",
        "nick": "plotter_prints/fill_circles",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pen on Bristol paper.<br><br>Created for Day 11 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_11_a_full.jpg",
            "day_11_b_full.jpg",
            "day_11_close.jpg"
        ]
    },
    {
        "name": "Frayed Knot Pattern",
        "nick": "plotter_prints/frayed_knot",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pens on Bristol paper.<br><br>Created for Day 10 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_10_full.jpg",
            "day_10_close.jpg",
            "day_10_close2.jpg"
        ]
    },
    {
        "name": "Noise Ripples",
        "nick": "plotter_prints/noise_ripples",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pen on Bristol paper.<br><br>Created for Day 8 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_08_trim.jpg",
            "day_08_close.jpg"
        ]
    },
    {
        "name": "This (Might Be) a Place of Honor",
        "nick": "plotter_prints/place_of_honor",
        "year": "2020",
        "description": "9\"x12\"<br>Micron pen + metallic pens on Bristol paper.<br><br>Created for Day 6 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_06_full.jpg",
            "day_06_close.jpg",
            "day_06_with_pens.jpg"
        ]
    },
    {
        "name": "Wave Form",
        "nick": "plotter_prints/wave_form",
        "year": "2020",
        "description": "18\"x12\"<br>Metallic pens on Bristol paper.<br><br>Created for Day 5 of Inktober 2020. This large plot traces slightly offset lines that are modulated using sine waves.<br><br>You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_05_full.jpg",
            "day_05_close3.jpg",
            "day_05_close2.jpg",
            "day_05_progress.jpg",
            "day_05_close.jpg"
        ]
    },
    {
        "name": "Circular Offset Maze",
        "nick": "plotter_prints/circular_offset_maze",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pens on Bristol paper.<br><br>Created for Day 4 of Inktober 2020. This triple exposure print was done by plotting the same design, slightly moving the arm each time.<br><br>You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_04_close.jpg",
            "day_04_full.jpg",
            "day_04_mid_print.jpg"
        ]
    },
    {
        "name": "Fulcrum",
        "nick": "plotter_prints/fulcrum",
        "year": "2020",
        "description": "9\"x12\"<br>Gel pens & metallic pens on Bristol paper.<br><br>Created for Day 3 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_03.jpg",
            "day_03_close.jpg"
        ]
    },
    {
        "name": "Floating City",
        "nick": "plotter_prints/floating_city",
        "year": "2020",
        "description": "18\"x12\"<br>Gel pens on Bristol paper.<br><br>Created for Day 2 of Inktober 2020. You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "day_02_big.jpg"
        ]
    },
    {
        "name": "Orrery",
        "nick": "plotter_prints/orrery",
        "year": "2020",
        "description": "12\"x9\"<br>Micron pen on Bristol paper.<br><br>Created for the first day of Inktober 2020, this drawing was based on a <a href='https://twitter.com/Andy_Makes/status/1309248572932739072'>tweet-length Processing sketch</a> I had made.<br><br>You can find the source code for my Inktober drawings <a href='https://github.com/andymasteroffish/inktober_2020'>here</a>.",       
        "tags": [
            "Plotter"
        ],
        "pics": [
            "orrery_full.jpg",
            "orrery_progress.JPG"
        ]
    },




    {
        "name": "Andy Wallace",
        "nick": "about",
        "year": "1988",
        "description": "Andy Wallace is an independent game designer and creative coder who lives in NYC. He is also a founding member of the non-profit <a href='https://arcadecommons.org/'>Arcade Commons</a> (Previously called <a href='http://deathbyaudioarcade.com'>Death By Audio Arcade</a>). He received his MFA from Parsons The New School For Design in 2012, and worked for a few years at the tiny NYC game company Golden Ruby Games. After that, he was the director of the Digital Game Design & Development program at Long Island University Post Campus. In 2022 he was one of the cofounders of <a href='https://emma.coop/'>EMMA</a>, a worker-owned creative technology cooperative that is currently available to work on your projects!<br><br>He started coding on his parents' IBM 386 when he was 10, and shows no signs of stopping anytime soon. He loves using computers to make magic. If you have freelance inquiries or just want to say hi, he can be reached at <a href='mailto:andy@andymakes.com'>andy@andymakes.com</a> or <a href='https://twitter.com/Andy_Makes'>@andy_makes</a>. I'm sure he'd love to hear from you.<br><br>His work has been featured on <a href='http://www.gamasutra.com/blogs/BenServiss/20140114/208574/Particle_Mace_The_Space_Game_About_Selflessness.php'>Gamastutra.com</a>, <a href='http://indiegames.com/index.html'>IndieGames.com</a>, <a href='http://www.engadget.com/'>Engadget.com</a>, <a href='http://www.pcworld.com/'>PC World</a>, and <a href='http://www.creativeapplications.net/'>CreativeApplications.net</a> among others. His work has been shown throughout the world at places like <a href='http://www.indiecade.com/'>IndieCade</a>, <a href='http://americanart.si.edu/calendar/family/?trumbaEmbed=view%3Devent%26eventid%3D112227868'>The Smithsonian American Museum Of Art</a>, <a href='https://dublin.sciencegallery.com/'>The Dublin Science Gallery</a>, <a href='http://www.sfmoma.org/'>SF MoMA</a>, <a href='http://magfest.org/'>MAGfest</a>, <a href='http://bicfest.org/'>The Busan Indie Connection Festival</a> in Korea, and <a href='http://www.movingimage.us/'>The Museum of The Moving Image</a>.<br><br>You can view his CV <a href='https://andymakes.com/cv'>here</a>.",
        "tags": [
            "About"
        ],
        "pics": [
            "scarf_small.jpg"
        ]
    }

    
]